[{'comments': [{'author': 'Chelsea_M_Williams', 'created': '2025-01-02 12:15:48', 'text': 'I have a bunch of free resources for finances for businesses (ie. Financial Success Guides, Info on how to choose an entity type, CFO checklist, KPIs, etc.) - [https://www.moneymastery.work/free-tools-access](https://www.moneymastery.work/free-tools-access) I started a new podcast, Always and Never About Money, for both personal and business finances. It's free to listen to all episodes - [https://itsalwaysandneveraboutmoney.buzzsprout.com/share](https://itsalwaysandneveraboutmoney.buzzsprout.com/share)', 'upvotes': 4}, {'author': 'John_Gouldson', 'created': '2025-01-02 11:04:16', 'text': 'Love this idea. Here you go, a free link to one of our yachting and lifestyle magazines. Ton of cool stuff for cars, planes and such. Pretty fun read. Enjoy! : [https://iyblue.com/magazine/iybluemag007.pdf](https://iyblue.com/magazine/iybluemag007.pdf)', 'upvotes': 2}, {'author': 'Suly18', 'created': '2025-01-02 12:01:11', 'text': 'this is great! i run a digital marketing company helping businesses get leads/sales & i’d love to offer a 33% discount off our services if anyone is interested', 'upvotes': 2}, {'author': 'hanslee201', 'created': '2025-01-02 15:44:47', 'text': 'Hi! My name is Hans and I lead the partnership efforts at [**Unblocked Brands**](http://unblockedbrands.com). We recently launched a product called **Passport**. It’s a **push notification tool** that helps you cut through the noise of the social media algorithm, so when you announce new products or videos/content, instead of hoping people will see it via IG (2% avg engagement rate)or an email newsletter (15-20% avg open rate), it would be sent to people’s phones as a push notification (**90% avg engagement rate**), so they definitely see it (100% delivery). **^(TD&LR)** Here’s what makes push notifications a game-changer: 🔹 **Immediate attention**: 40% of push notifications are viewed within an hour (vs 7.5 hours for email). 🔹 **No gatekeepers**: You decide when and how to engage your audience. 🔹 **Your brand, your rules**: Deliver exclusive updates, perks, or offers right to their device. As my first post here on r/Entrepreneur, I'd be happy to provide a **free Growth Plan** ($399/mo) to anyone that signs up **by Jan 9th**! 🔥 Free Sign-Up [**here**](http://unblk.co/tythursday). 💪 Also receive free support by joining our Slack Channel [**here**](https://join.slack.com/t/unblockedbrands/shared_invite/zt-2vj8itpmu-gjV7X1lzIpWcB3qd1cPG~w).', 'upvotes': 2}, {'author': 'heythisischris', 'created': '2025-01-02 19:23:09', 'text': 'Hey ya'll! Offering a free week Tabchat AI. Tabchat AI is a Chrome extension that lets you chat directly with your active tabs. We securely scrape the HTML data from your DOM, send it over to our LLM, and viola- you're able to receive AI assistance with any website you're currently browsing. The possibilities, as you might imagine, are endless. Need help with a forum post? Done. Seeing if a product is worth purchasing? We can help. Need to extract data from a table? Piece of cake. In short: • Chat with any tab you have open • Easily extract unstructured data to CSV/JSON • Summarize articles & grab key points • Pick up on hidden context you might not see at first • Enormous 300k context powered by Amazon Nova Only $9.99/month for unlimited usage- get started with a 7 day free trial! Let me know what you think. Open to any and all feedback. Chrome Extension URL: https://chromewebstore.google.com/detail/tabchat-ai/belpggoeapomplfgocfednggkbimicph', 'upvotes': 2}, {'author': 'Feisty_Attorney_3811', 'created': '2025-01-02 23:32:20', 'text': 'Anyone looking to get into investing in stocks? I have a referral code for Questrade that I can provide for up to 10 people. If you use the code it will start you off with $50! Happy to send it to whoever could use the promotion.', 'upvotes': 1}, {'author': 'Virtual_Welder_2467', 'created': '2025-01-03 10:10:49', 'text': 'Want to receive some insights about your project or website? I'm here to help you! I'm a software developer with a lot of experience on the web field and i'm sure that i can give some advices about your online presence, send me a DM and i will be checking your website, if i find something that can be improved, i will be telling you!', 'upvotes': 1}, {'author': 'Hopeful_Piglet2416', 'created': '2025-01-03 16:21:09', 'text': 'Happy New Year everyone! anyone who has a brilliant business idea that's not capital intensive for this year 2025?', 'upvotes': 1}, {'author': 'johnrich85', 'created': '2025-01-03 16:43:55', 'text': 'Hey all. Im currently offering lifetime membership to Listable (no code directory builder) for a one off fee. Check it out if interested: https://get-listable.com', 'upvotes': 1}], 'id': '1hrqg5q', 'num_comments': 10, 'text': '**Your opportunity to thank the** /r/Entrepreneur **community by offering free stuff, contests, discounts, electronic courses, ebooks and the best deals you know of.** Please consolidate such offers here! Since this thread can fill up quickly, consider sorting the comments by "new" (instead of "best" or "top") to see the newest posts.', 'title': 'Thank you Thursday! - January 02, 2025', 'upvotes': 6, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1hrqg5q/thank_you_thursday_january_02_2025/'}, {'comments': [{'author': 'dotMartin_', 'created': '2025-01-04 12:26:18', 'text': 'What tools did you use?', 'upvotes': 6}, {'author': 'ISayAboot', 'created': '2025-01-04 12:56:33', 'text': 'Curious more about how you built', 'upvotes': 7}, {'author': 'Trismegistvss', 'created': '2025-01-04 13:22:58', 'text': 'Everytime i hear AI in youtube or whatever platform it turns me off, immediately i discount it. A fix would be maybe have a more natural voice input, there’s AI for it. There’s one that collects your voice style by reading certain words and spits it out. Or a morgan freeman voice would be pleasant', 'upvotes': 8}, {'author': 'helk1d', 'created': '2025-01-04 16:54:03', 'text': '**To all who wonder how this kind of stuff is made:** 1. A book content ingestion system, it might leverage existing book summary databases or APIs 2. A large language model (like GPT-4o or Claude) for: \- Extracting and summarizing key concepts, from books for example. \- Restructuring content into podcast script format 3. An AI text-to-speech system: systems like ElevenLabs, [Play.ht](http://Play.ht), or Coqui could provide natural-sounding narration', 'upvotes': 3}, {'author': 'philbarnhart', 'created': '2025-01-04 14:55:11', 'text': 'How are you promoting this?', 'upvotes': 2}, {'author': 'Distinct_Author2586', 'created': '2025-01-04 17:28:02', 'text': 'How does the copyrighting work here? Does a voice actor own their work, or does something get paid to the writer of the material?', 'upvotes': 2}, {'author': 'akbaraziz', 'created': '2025-01-04 13:21:01', 'text': 'Just heard the first one. Excellent job!', 'upvotes': 2}, {'author': 'ISayAboot', 'created': '2025-01-04 12:56:21', 'text': 'Nice work', 'upvotes': 1}, {'author': 'KelbyLK', 'created': '2025-01-04 13:23:37', 'text': 'Cool idea I’ll check it out', 'upvotes': 1}, {'author': 'Intelligent-Snow-744', 'created': '2025-01-04 13:26:02', 'text': 'Intresting', 'upvotes': 1}, {'author': 'sprchrgd_adrenaline', 'created': '2025-01-04 13:43:12', 'text': 'Is everyone able to see it? I can see the podcast but don't see any episodes. Edit: got it. It's pretty great. More episodes coming in the future I hope', 'upvotes': 1}, {'author': 'NickyD_', 'created': '2025-01-04 16:51:34', 'text': 'Its good but needs more pauses. Feels like i don’t have time to process the information. Preferably after sentences', 'upvotes': 1}, {'author': 'buchinho', 'created': '2025-01-04 18:15:33', 'text': 'Can you release the episodes as RSS so that and Podcast player can be used?', 'upvotes': 1}, {'author': 'gritpop', 'created': '2025-01-04 12:57:11', 'text': 'Thanks for this. You going to do more episodes?', 'upvotes': 1}, {'author': 'david_slays_giants', 'created': '2025-01-04 13:54:19', 'text': 'How does your AI tool mimic the BEST PART of podcasts: INTERACTION? How does the AI monitor and IMPROVE on engagement?', 'upvotes': 0}, {'author': '[deleted]', 'created': '2025-01-04 12:46:35', 'text': '[deleted]', 'upvotes': 0}, {'author': 'themasterofbation', 'created': '2025-01-04 13:05:10', 'text': 'Probably Llama + a vector database (pinecone) and then eleven labs or an open source ai voice generator', 'upvotes': 12}, {'author': 'riookoo', 'created': '2025-01-04 14:27:00', 'text': 'It’s not as complex as it might sound! Many large language models already have a “Knowledge” feature that lets you upload large files, essentially creating a vector database. For each episode, I start by doing some research—reading articles, collecting YouTube videos, and make the ai summarize these sources, then ask it to draw insights from the it’s knowledge base (which includes the books). The AI then synthesizes everything into a storytelling-style script based on its “Dan Karnahal” persona which goes to a text to speech engine', 'upvotes': 10}, {'author': 'mindartify', 'created': '2025-01-04 17:44:56', 'text': 'I can help you to build similar or advance ai tool.', 'upvotes': 1}, {'author': 'leppardfan', 'created': '2025-01-04 16:39:40', 'text': 'I'm curious how he got the LLM to extract the ideas/concepts and which LLM is the best at this', 'upvotes': 1}, {'author': 'helk1d', 'created': '2025-01-04 16:54:42', 'text': 'I made a comment that answers your question, hope it helps', 'upvotes': 1}, {'author': 'InhumanWhaleShark', 'created': '2025-01-04 14:13:05', 'text': 'Notebook LLM has a really impressive demo where 2 AIs talk like they're on a podcast. Try it, I was blown away.', 'upvotes': 3}, {'author': 'jivebotic', 'created': '2025-01-04 16:38:41', 'text': 'Does this sound like an AI voice? To me his podcast sounds pretty friggin good. I don't think I'd guess it's AI.', 'upvotes': 1}, {'author': 'riookoo', 'created': '2025-01-04 16:40:52', 'text': 'Honestly, I haven’t thought about it much yet—it’s still just an experiment. I love the results so far; it’s already providing a lot of value to me. If I see that others find it valuable too, I’ll definitely keep it going!', 'upvotes': 2}, {'author': 'KelbyLK', 'created': '2025-01-04 17:11:03', 'text': 'Dude this is excellent! Listened to both episodes, well done Is it on Apple Podcasts too? Can’t find it there', 'upvotes': 1}, {'author': 'riookoo', 'created': '2025-01-04 14:35:38', 'text': 'Absolutely! There are already three more episodes scheduled to drop every Friday, with plenty more in the pipeline. One of the episodes I’m most excited about is coming next Friday—it’ll dive into autonomous vertical AI agents and explore how they’re shaping opportunities to cash in.', 'upvotes': 2}, {'author': 'TheBlacktom', 'created': '2025-01-04 13:07:17', 'text': 'You can read the post to get the answer.', 'upvotes': 1}, {'author': 'Ashamed_Success5496', 'created': '2025-01-04 13:51:44', 'text': 'Probably refine document chain. It is a summarisation problem.', 'upvotes': 0}, {'author': 'themasterofbation', 'created': '2025-01-04 13:53:24', 'text': 'You are right, very suitable for multiple books Any idea on an open source voice generator?', 'upvotes': 2}, {'author': 'helk1d', 'created': '2025-01-04 16:57:05', 'text': 'Check this out, it might help [https://www.reddit.com/r/LocalLLaMA/comments/1f0awd6/best\_local\_open\_source\_texttospeech\_and/](https://www.reddit.com/r/LocalLLaMA/comments/1f0awd6/best_local_open_source_texttospeech_and/)', 'upvotes': 3}], 'id': '1htgk9v', 'num_comments': 30, 'text': 'Over Christmas break, I started tinkering with an idea, a simple experiment to pass the time. What if I could build an AI podcaster that reads 100 of the best business books, extracts the most interesting ideas, and turns them into short, actionable episodes? It sounded fun, so I gave it a shot. What I didn’t expect was how much it would blow my mind. This AI didn’t just regurgitate information—it captured the essence of each book with a clarity and focus that felt almost... human. Somehow, it managed to distill complex ideas into their simplest, most powerful forms. The kind of takeaways that stick with you, long after you’ve heard them. I sat there, listening to the AI narrate its findings, and I couldn’t help but feel amazed... This was more than I thought I’d create in a weekend project. It captured a kind of value that felt almost too good to keep to myself. So here it is: my AI podcaster experiment in action. And this is just the beginning—new episodes will be released every single week, diving deeper into the best ideas in entrepreneurship. 🎧 Check it out on Spotify: Founder's Coffee Break', 'title': 'I Made an AI Podcaster That Reads 100 Business Books', 'upvotes': 123, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1htgk9v/i_made_an_ai_podcaster_that_reads_100_business/'}, {'comments': [{'author': 'Bruce-All-Mighty88', 'created': '2025-01-04 15:23:22', 'text': 'Resilience? The ability to bounce back from failures or setbacks and keep going is crucial. Entrepreneurship is full of ups and downs, and resilience keeps you in the game Risk Tolerance? They’re comfortable stepping out of their comfort zone and taking calculated risks to seize opportunities', 'upvotes': 42}, {'author': 'throwaway23029123143', 'created': '2025-01-04 15:32:25', 'text': 'Idiotic optimism to the point where everyone else would have quit six months ago', 'upvotes': 38}, {'author': 'RossDCurrie', 'created': '2025-01-04 15:36:21', 'text': 'It's been studied extensively. It's things like a high internal locus of control, ability to delay gratification, etc. Look it up on Google scholar', 'upvotes': 17}, {'author': 'Unlucky_Skirt8310', 'created': '2025-01-04 15:30:52', 'text': 'I run a fence and hardscape company from what I’ve learned and things I do in my life is We don’t half ass anything your either in or out. We always find ways to improve everything from sales-the crew. High risk tolerance- I look at the positives and opportunities with every debt or a big purchase to the buisness. Everyone always overestimates the negatives. We treat the time as race and we have to get as much done in a day. We don’t let emotions take over at all no matter the situation, this helps with decision making on a bad time in buisness.', 'upvotes': 18}, {'author': '89dpi', 'created': '2025-01-04 15:27:05', 'text': 'Perhaps its even "lets do it". They get started. They won´t stop until its done as it supposed to be. Same time they think with their own head. Super motivated to work hard. I know some successful middle managers but when I think what separates them from the rockstars is reaction speed. Successful people work hard or have done it at some point. They are good at making deals. You can always win something if you negotiate with them.', 'upvotes': 8}, {'author': 'GrabWorking3045', 'created': '2025-01-04 15:38:21', 'text': 'Grit', 'upvotes': 5}, {'author': 'Admirable-Style4656', 'created': '2025-01-04 16:13:58', 'text': 'ADHD or dyslexia (serious)', 'upvotes': 4}, {'author': 'GrindPilled', 'created': '2025-01-04 15:46:37', 'text': 'They stay grinding', 'upvotes': 3}, {'author': 'ContestInteresting21', 'created': '2025-01-04 16:02:31', 'text': 'Unbreakable', 'upvotes': 3}, {'author': 'Ok-Vermicelli-9882', 'created': '2025-01-04 16:26:32', 'text': '**Persistence**. They can keep going despite being told no over and over, no matter how competitive the landscape is. **Adaptability**. Think about the companies that started as one thing and ended up doing something different. Instagram started as a check-in app called Burbn. Netflix began as a DVD-by-mail service.', 'upvotes': 3}, {'author': 'Physical-Asparagus-4', 'created': '2025-01-04 16:36:18', 'text': 'A true and unreasonable belief that you can do something better than its already being done Ability to filter noise and naysayers and laugh at them Laser sharp focus on actual outcomes even when “goals” are not yet defined OCD type obsession with outcomes- zero awareness of work/life balance concept. Aka the “ill sleep when im dead” mentality Risk tolerance ^ Sense of humor Sense of pride', 'upvotes': 3}, {'author': 'edkang99', 'created': '2025-01-04 16:02:05', 'text': 'This is an interesting list I saw once for the ULTRA successful (think Michael Jordan and Elon Musk) from Ben Horowitz: 1. Superiority Complex: they believe they are better and can do better than others 2. Crippling insecurity: fear of failure drives them to overdeliver and never be complacent. 3. Unyielding need for achievement: relentless with goals. From a psychological perspective, they are (Big Five Personality): 1. High openness 2. Low conscientiousness 3. High extroversion 4. Low agreeableness 5. Low neuroticism Interesting note that these psychological traits are somewhat the opposite of what is required for long term healthy relationships.', 'upvotes': 4}, {'author': 'MortalMachine', 'created': '2025-01-04 15:53:14', 'text': 'Obsession with their startup. Meaning they are thinking about everything to do with it every hour of every day even in whatever off-time they have. That's what I took away from watching movies and documentaries about Mark Zuckerberg, Bill Gates, and Steve Jobs. Obsession to improve it, innovate, figure out what will make money, etc.', 'upvotes': 2}, {'author': 'Spare-Balance-9288', 'created': '2025-01-04 16:01:00', 'text': 'Grit', 'upvotes': 2}, {'author': 'johngunthner', 'created': '2025-01-04 16:05:33', 'text': 'Tenacity', 'upvotes': 2}, {'author': 'sigh_duck', 'created': '2025-01-04 16:13:06', 'text': 'The ability to keep going despite seemingly insurmountable problems.', 'upvotes': 2}, {'author': 'poopysmellsgood', 'created': '2025-01-04 16:23:24', 'text': 'Not only do you have to be a great problem solver, but you have to love the gratification that comes with overcoming the challenge.', 'upvotes': 2}, {'author': 'Magnus1rex', 'created': '2025-01-04 16:23:36', 'text': 'Adaptability with strong grit', 'upvotes': 2}, {'author': 'BrineWR71', 'created': '2025-01-04 16:24:36', 'text': 'Risk tolerance', 'upvotes': 2}, {'author': 'Crafty-Macaroon3865', 'created': '2025-01-04 16:27:45', 'text': 'I knew an entrepreneur before they made it . Extreme self confidence( everyone is telling they cant and everyone sees all the debt and cant see the light at the end of the tunnel) the entrepreneur keeps pushing at this point, high risk tolerance willing to grind for sometimes a decade with no results and incredible amounts of luck. But the luck wouldnt have been possible without the grind before hand. Sometimes scientific thinking and entrepreneurship cant work together because it tries to over analyze stuff and look at probability sometimes the number is stacked against you like chance of success is 1/billion people have won the lottery before usually entrepreneurship isnt that but it can be in some industries', 'upvotes': 2}, {'author': 'NoVast209', 'created': '2025-01-04 17:25:59', 'text': 'Id like to think successful entrepreneurs almost need some degree of delusion to ignore any external reasons on why their idea may not work LOL', 'upvotes': 2}, {'author': 'More-Talk-2660', 'created': '2025-01-04 16:48:54', 'text': 'A good entrepreneur knows that whether to see the glass as half full or half empty depends a great deal on what's in the glass, and who you need to market it to.', 'upvotes': 1}, {'author': 'El_Loco_911', 'created': '2025-01-04 16:55:23', 'text': 'Good at learning multiple things, good at prioritizing what is important to do and what is not. Very likeable and able to sell. Passionate about what they do and excited about projects. Wants things done quickly and will jump in to help with anything if its not done fast enough. Extremely persistant and detail oriented. Constant drive to do better and be more efficient. Good with people and good listener. Big dreams and visions with concrete plans to execute them. Good at strategic decision making. Exercises every day. Dont use drugs or alcohol. Take nap whenever tired to be more productive. Not good at being patient. Not good at following all the rules. Not good at being satisified with status quo. Not good at relaxing and taking time off. This is me personally. I am very successful in my entreprenuer journey but only been 1 year so far.', 'upvotes': 1}, {'author': 'Beneficial_Past_5683', 'created': '2025-01-04 16:58:13', 'text': 'Not sure about the deferred gratification thing. I want it, and I want it Now!', 'upvotes': 1}, {'author': 'gravity_kills_u', 'created': '2025-01-04 17:13:58', 'text': 'They make sales while others talk aboutvit', 'upvotes': 1}, {'author': 'MandoFromStarWars', 'created': '2025-01-04 17:22:22', 'text': 'On behalf of all male entrepreneurs a Massive Cock', 'upvotes': 1}, {'author': 'DiamondMan07', 'created': '2025-01-04 17:26:58', 'text': 'Social and outgoing. Introverts rarely succeed unless they invent something.', 'upvotes': 1}, {'author': 'thesleepiestmonkey', 'created': '2025-01-04 17:28:56', 'text': 'Check out the [E13 Research Study](https://thee13.com/thee13s-competencies/). It lists the 13 competencies of entrepreneurship. The website includes an assessment to check your own performance in these competencies.', 'upvotes': 1}, {'author': 'zer0faction', 'created': '2025-01-04 17:33:10', 'text': 'A friend of mine ran a very successful rope selling business and he had a kind of fearlessness to him because he always used to say that even if you fail there is always a way out of your troubles and he was very passionate about that. He wasn't the same after the accident unfortunately and has since passed away and with that his business just fell over like the ice cream falls of a cone that a toddler is holding (toddlers can be stupid) so yeah oh and he was positive when it came to his business and all that he even hired his ex wife before that because he saw potentionalnol in her but at some point the other ex wife he had also got hired outside of his knowledge and that's were the trouble started, but anyway, stay positive and uhh don't give up and uhm.. if you fail you can always take the easy way out.', 'upvotes': 1}, {'author': 'ampcinsurance', 'created': '2025-01-04 17:36:52', 'text': 'Be curious and process every possible scenario before jumping in.', 'upvotes': 1}, {'author': 'Zestyclose_Trash3606', 'created': '2025-01-04 17:46:15', 'text': 'Surprises me alot of people don’t mention physical fitness and mental health. Those are both very important', 'upvotes': 1}, {'author': 'AdvanceFeisty3142', 'created': '2025-01-04 18:06:10', 'text': 'Callousness', 'upvotes': 1}, {'author': 'Nxs28_', 'created': '2025-01-04 15:31:54', 'text': 'The trait of Menifesting and "Law of attraction". The idea that they know everything is going to work out even through the struggles and success's. "If you look in the mirror and tell yourself you'll never be great, You'll never be great". On an unrelated note, Would love to help you out with any graphical help you may need in terms of rebranding/Creating a Logo or even creating a 3D mockup of a product. If this sounds like something you'd be interested in, Drop me a DM! :P', 'upvotes': 1}, {'author': 'Nice-Personality5496', 'created': '2025-01-04 16:15:53', 'text': 'Access to money. Having family money to fall back on if they fail.', 'upvotes': 1}, {'author': 'Remach-Humano', 'created': '2025-01-04 16:32:06', 'text': 'Away from emotions and their feelings, disconnected and their way is all rational, I have seen many of them suffer heart attacks, terminal cancer, etc. The most important thing is the state of Zen of balance that means not being a millionaire perhaps but you will live a life full of wisdom and happiness 😬❤️🙌😎', 'upvotes': 0}, {'author': 'AbusedShaman', 'created': '2025-01-04 16:50:15', 'text': 'agree', 'upvotes': 1}, {'author': 'icrossedcurry', 'created': '2025-01-04 16:36:25', 'text': 'Best answer', 'upvotes': 5}, {'author': 'elforce001', 'created': '2025-01-04 18:04:03', 'text': 'This x 💯. You have to be crazy just to even consider going 1,2,... 5 years chasing an idea you don't even know will work.', 'upvotes': 1}, {'author': 'ykoreaa', 'created': '2025-01-04 16:36:13', 'text': 'Yah, grit & vision are two big ones. Money & connections if they don't have influential speaking skills too.', 'upvotes': 2}, {'author': 'Zestyclose_Trash3606', 'created': '2025-01-04 17:45:32', 'text': 'One in three successful entrepreneurs are dyslexic', 'upvotes': 1}, {'author': 'West_Armadillo_4041', 'created': '2025-01-04 16:14:10', 'text': 'Low conscientiousness doesn’t make sense to me.', 'upvotes': 4}, {'author': 'LadysaurousRex', 'created': '2025-01-04 16:10:34', 'text': 'These are amazing lists and I appreciate your note on the bottom. Great contribution I can see where neuroticism would prevent people from doing anything ha that’s funny', 'upvotes': 2}, {'author': 'SireSweet', 'created': '2025-01-04 16:23:54', 'text': 'When you say it like that it makes sense', 'upvotes': 1}, {'author': 'Isotope1', 'created': '2025-01-04 16:47:26', 'text': 'Out of curiosity, where did you find these? If it’s a Horowitz interview, I’d love to listen to it!', 'upvotes': 1}, {'author': 'NoVast209', 'created': '2025-01-04 17:28:17', 'text': 'Arguably NOT having something to fall back on could be what makes someone successful, because they dont have a choice to not be successful', 'upvotes': 1}, {'author': 'KnightDuty', 'created': '2025-01-04 16:36:54', 'text': 'Think Low conscientiousness as "recklessness". Also understand that this list suffers from confirmation bias because it's asking the wrong question. It doesn't ask "what qualities offer the highest chance for success". It asks "what qualities do the richest people possess" Imagine putting 10,000 reckless, thoughtless, risktakers in a casino. Now also put 10,000 levelheaded, responsible people in a different casino. Then ask the question "who made the most money?" The top earners will be somebody from the reckless camp just by virtue of the math - ONE of those 10,000 people who kept deciding to risk it all will have actually succeeded. So they double their money and then double it again and double it again. 9,999 of them failed because it's a stupid move. But one of them succeeded and that person will by far have seen more "success" than everybody else put together. Meanwhile, the levelheaded people have no destitute failures. Some did fairly well, others had marginal losses, everybody had a great time. So if we're asking the question "what qualities do the richest people possess" the answer will be that reckless dumbasses make it to the top. If we ask "what qualities offer the highest chance for success" those same qualities are put at the bottom of the list, because for every single success there were 9,999 failures. That data should be looked at the same way as the following piece of advice: "the quickest way to earn money is to win the lottery". When you are reckless, your success or failures are just blind luck.', 'upvotes': 5}, {'author': 'edkang99', 'created': '2025-01-04 16:17:53', 'text': 'Evidently, while high conscientiousness helps with things like follow-through and reliability, having a low one allows you to be chaotic and break the rules as a contrarian. It's like how some people never keep their promises yet still climb to the top making those promises. Not for me, but hey, people are nuanced.', 'upvotes': 2}, {'author': 'edkang99', 'created': '2025-01-04 16:54:08', 'text': 'It's a list attributed to Ben Horowitz often quoted by other entrepreneurs. I heard Alex Hormozi talk about it but have never found the source. Sorry, wish I had it as well.', 'upvotes': 2}, {'author': 'edkang99', 'created': '2025-01-04 16:55:37', 'text': 'Well said.', 'upvotes': 1}, {'author': 'West_Armadillo_4041', 'created': '2025-01-04 16:27:06', 'text': 'After reading more about it, the most successful entrepreneur I know has no structured schedule, always makes promises they can’t follow through with and throws task at others at the last second. So it kind of makes sense.', 'upvotes': 2}], 'id': '1htkh37', 'num_comments': 53, 'text': 'I often think about the traits that make people good entrepreneurs. I think a main one is a “can do” “glass is half-full” attitude. What are some others?', 'title': 'What personality traits do successful entrepreneurs have?', 'upvotes': 26, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1htkh37/what_personality_traits_do_successful/'}, {'comments': [{'author': 'ExcuseMeIHaveQuestns', 'created': '2025-01-04 18:23:17', 'text': 'Love this. I just started my entrepreneurial journey a year ago and am slowly learning (by making a ton of mistakes) but seeing the growth and it’s really rewarding and humbling seeing myself able to build something from scratch. I came at it with the mindset of, “if someone else has done it—so can I”. If I can do it, so can anyone. Shoot your shot, take the risk, live.', 'upvotes': 1}, {'author': 'Prudent_Homework8718', 'created': '2025-01-04 18:26:19', 'text': 'MBA are for managers.', 'upvotes': 1}], 'id': '1htopfc', 'num_comments': 2, 'text': 'I’m not anti-education. But sometimes I wonder if the MBA is just a really overpriced permission slip to call yourself an entrepreneur. I started my company without a degree. No formal training. Just trial, error, and a lot of Googling. And somehow, I still ended up in the same rooms as people who paid six figures to learn how to write case studies about other people’s success. Meanwhile, I spent that time actually building something. It wasn’t pretty—there were questionable decisions, missed payrolls, and enough duct-tape solutions to make a NASA engineer nervous. But guess what? It worked. I’m not here to knock anyone who’s pursuing an MBA. But let’s not pretend it’s the golden ticket to running a business. Most of the entrepreneurs I know didn’t get to where they are because of a classroom. They got there by throwing themselves into the fire, burning a little, and figuring it out. If an MBA helps you sleep at night, great. But for those of you wondering if you need one to start—trust me, you don’t. You need grit, decent instincts, and the ability to learn fast when things inevitably go wrong. I’d take those over a degree any day.', 'title': 'MBAs Are Starting to Feel Like Expensive Confidence Boosters – I Built a 7-Figure Business Without One', 'upvotes': 4, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1htopfc/mbas_are_starting_to_feel_like_expensive/'}, {'comments': [{'author': 'drhindsight95', 'created': '2025-01-03 18:25:41', 'text': 'These were my favs M. E. Gerber - The E myth - must read Osterwalder - business model generation - helps you understand the way a business works / changes B Horowitz - The hard thing about hard things - it's fun +2 extra: - you have to understand how much extra money you need to scale - growth phases - evolution stages / revolution stages', 'upvotes': 163}, {'author': 'MacPR', 'created': '2025-01-03 18:31:56', 'text': 'E-myth. And any accounting book. Anything with the guy on the cover is anecdotal bullshit.', 'upvotes': 62}, {'author': 'Intrepid-Object8617', 'created': '2025-01-03 18:39:08', 'text': 'Depends on what stage you are at and what you are looking for, but I recommend the ones below: 1. The startup owner's manual (Steve Blank and Bob Dorf) 2. Disciplined Entrepreneurship: 24 Steps to a Successful Startup (Bill Aulet)', 'upvotes': 35}, {'author': 'pheldozer', 'created': '2025-01-03 19:10:27', 'text': 'How to win friends and influence people is timeless.', 'upvotes': 30}, {'author': 'Maleficent-Long-8290', 'created': '2025-01-03 19:07:29', 'text': 'Anything from MJ DeMarco', 'upvotes': 31}, {'author': 'Peepeepoopoobuttbutt', 'created': '2025-01-03 18:20:53', 'text': 'Some biographies are good, but the rest are like real estate books…. Just wing it bud.', 'upvotes': 9}, {'author': 'BillySavery', 'created': '2025-01-03 19:12:22', 'text': 'Rework by the people who created Ruby on the Rails', 'upvotes': 8}, {'author': 'Far-Potential3634', 'created': '2025-01-03 18:46:24', 'text': 'Drucker is quite good imo. I've read a couple of his books. Dan Kennedy can be a bit flashy but at the core he is a no-nonsense guy you can learn a lot from. Kennedy tells people they can consume as much information as they want (and it tends to get repetitive the more stuff you read) but at the end of the day you are stuck with you and your specific problems you need to solve. I've read some books on consulting that were very good. Million Dollar Consulting and Flawless Consulting were excellent reads written by real pros.', 'upvotes': 8}, {'author': 'Ralphisinthehouse', 'created': '2025-01-03 18:55:19', 'text': 'As long as you go into them with the mindset of it being fun to see how someone else did it and not them being an instruction manual to getting rich most of them are a good wheeze.', 'upvotes': 6}, {'author': 'Ausiir63', 'created': '2025-01-03 19:23:09', 'text': 'Contagious by Jonah Berger.', 'upvotes': 4}, {'author': 'stealthagents', 'created': '2025-01-03 20:08:10', 'text': 'Alright, here are a few books that I’ve read (and actually liked) when it comes to entrepreneurship. No fluff, just solid advice: 1. **The Lean Startup by Eric Ries** * Teaches you how to test ideas fast without wasting time or money. It’s all about learning as you go. 2. **Atomic Habits by James Clear** * Okay, not strictly a business book, but it’s amazing for building the kind of habits that make you more productive. 3. **Zero to One by Peter Thiel** * Makes you think differently about building something unique instead of competing with a hundred others. 4. **Shoe Dog by Phil Knight** * Phil’s story about how Nike started from scratch is crazy inspiring and super real. 5. **The E-Myth Revisited by Michael Gerber** * This one blew my mind. It’s all about creating systems so you don’t get stuck doing *everything* yourself. 6. **Traction by Gino Wickman** * If you’re looking to scale and keep everything organized, this one’s gold. What are you working on right now? That might help me recommend something even more specific!', 'upvotes': 20}, {'author': 'Sensitive-Law2400', 'created': '2025-01-03 18:28:55', 'text': 'Million Dollar Weekend, Fast Lane Millionaire, Blue Ocean Strategy.', 'upvotes': 10}, {'author': 'Dazzling_Deer9592', 'created': '2025-01-03 19:16:42', 'text': 'How to get rich by Felix Dennis. Reality transurfing by Vedim zeland The whole story- John Mackey Shoe dog- Phil knight All are great books that offer vast amount of knowledge and lessons.', 'upvotes': 3}, {'author': 'drewander123', 'created': '2025-01-03 20:26:52', 'text': 'Buy back your time by Dan Martell It’s basically the email mastery but a little bit more fun than straightforward to read Basically it identifies the main trap. The most business owners and entrepreneurs find themselves in, which is trying to do it all yourself because no one can do it good as you. The mantra that I took from the book is 80% good done by somebody else is 100% awesome! As soon as you find yourself getting into the trap and becoming overwhelmed and super negative about the business, it’s time to reinvest and hire new employees or create a new department to sort out the mess that is driving you crazy like payroll, accounting, answering phones, getting an assistant etc. etc.', 'upvotes': 3}, {'author': 'mymindset_com', 'created': '2025-01-03 18:32:25', 'text': 'Anything from Alex Hormozi', 'upvotes': 11}, {'author': 'Master-Newspaper-640', 'created': '2025-01-03 18:51:40', 'text': 'The one you will write after you made it :)', 'upvotes': 3}, {'author': 'Aggressive_Initial60', 'created': '2025-01-03 20:06:35', 'text': 'The Millionaire Fastlane !', 'upvotes': 2}, {'author': 'Agitated-Safety-7114', 'created': '2025-01-03 20:10:28', 'text': 'To Sell is Human, by Daniel Pink.', 'upvotes': 2}, {'author': 'Stunning_Werewolf235', 'created': '2025-01-03 20:51:40', 'text': 'Cal Newport(author of deep work) has some good books', 'upvotes': 2}, {'author': 'DLtheGreat808', 'created': '2025-01-03 22:05:19', 'text': 'Starting a Business for Dummies I feel like a lot of entrepreneurs are too quick to dive into the complex topics in business when they lack a lot of the basics.', 'upvotes': 2}, {'author': 'qwidjib0', 'created': '2025-01-03 22:42:52', 'text': 'I’ve read about 100. Saving you time, I’d read (in this order): Disciplined Entrepreneurship (Bill Aulet) Traction (Gino Wickman) Then whatever helps you deepen whatever each book introduces at any given time. Don’t treat any of these books as law.', 'upvotes': 2}, {'author': 'thatcolorboy', 'created': '2025-01-03 23:33:55', 'text': 'Books about how not to lose. Profit First & Winning Through Intimidation', 'upvotes': 2}, {'author': 'juju0010', 'created': '2025-01-03 19:20:52', 'text': 'The Mom Test', 'upvotes': 3}, {'author': 'Yoda4414', 'created': '2025-01-03 19:03:28', 'text': 'Blue Ocean', 'upvotes': 1}, {'author': 'Monsieur-Pi', 'created': '2025-01-03 19:13:15', 'text': '“The right it” for early stage entrepreneurs', 'upvotes': 1}, {'author': 'joe_mago', 'created': '2025-01-03 19:20:16', 'text': 'Entrepreneur Revolution by Daniel Priestly', 'upvotes': 1}, {'author': 'tookule4skool', 'created': '2025-01-03 19:23:45', 'text': 'The former accountant in me thought you meant financial books as their accounting records, lol.', 'upvotes': 1}, {'author': '808goddess', 'created': '2025-01-03 19:27:50', 'text': 'Can't believe no one has mentioned 10 X is easier than 2 times .. great book!', 'upvotes': 1}, {'author': 'drewsonofdean', 'created': '2025-01-03 19:32:10', 'text': 'E Myth!', 'upvotes': 1}, {'author': 'FineAnimeenjoyer', 'created': '2025-01-03 19:39:06', 'text': 'The Lean Startup - Eric Ries', 'upvotes': 1}, {'author': 'wilstar_berry', 'created': '2025-01-03 19:51:40', 'text': 'The Asking Formula - John Baker. It's a great communication tool.', 'upvotes': 1}, {'author': 'Lurtemis', 'created': '2025-01-03 20:15:49', 'text': 'The one I wrote 😏', 'upvotes': 1}, {'author': 'BanzaiTree', 'created': '2025-01-03 20:20:03', 'text': 'I thought Your Next Five Moves was good and Scale or Fail.', 'upvotes': 1}, {'author': 'Nixon_37', 'created': '2025-01-03 20:49:41', 'text': 'Nick Huber has a really good list of best business books. I haven't read all of them but I've really liked all of the ones I have read. https://www.nickhuber.com/content/the-absolute-best-business-and-self-help-books-out-there', 'upvotes': 1}, {'author': 'SkillfulGnome', 'created': '2025-01-03 21:00:09', 'text': 'I will say doing >>>>> reading when it comes to business. But I found Million dollar weekend the most practical book to get me off my tuckus and out there. Founding sales by Kazajny for the sales mindset and advice.', 'upvotes': 1}, {'author': 'probsunderqualified', 'created': '2025-01-03 21:04:47', 'text': 'The Perosnal MBA - by Josh Kaufman Honestly helped me ask myself and others better questions', 'upvotes': 1}, {'author': 'GibsonReports', 'created': '2025-01-03 21:25:06', 'text': 'Gap Selling by Keenan. Entrepreneurship is nothing without sales. Then Never Split the Difference by Chris Voss. Use both together to learn how to talk to people and do sales.', 'upvotes': 1}, {'author': 'Marketpro4k', 'created': '2025-01-03 21:58:05', 'text': '“The Art of War” by Sun Tzu is great for perspective on strategy, leadership and resource management.', 'upvotes': 1}, {'author': 'boss44lady', 'created': '2025-01-03 22:11:07', 'text': 'If your business is sales based, “No thanks, I’m Just Looking.” Changed the way I did business and even though I’m no longer in sales, the methods work well in every day life transactions. Also Guerrilla Marketing by Levinson. I had it back in college and still refer back to it. Unsure if there’s an updated copy that would include social media marketing but I think the old concepts can still be applied.', 'upvotes': 1}, {'author': 'Melodic_Ad6299', 'created': '2025-01-03 22:18:42', 'text': 'Is Reborn P4M in Tunisia an MLM Scam?', 'upvotes': 1}, {'author': 'Dependent-Button-901', 'created': '2025-01-03 22:28:32', 'text': 'Not sure if people already told you but $100M Leads by Alex Hormozi. The book is in large fonts for people to feel at ease when reading it. He goes through so many examples, pictures, actual "how tos." I am still reading the book, but I have learned so much from it.', 'upvotes': 1}, {'author': 'v0lume4', 'created': '2025-01-03 22:48:08', 'text': 'The Millionaire Fastlane by MJ DeMarco. Changed the way I looked at business, life, and money forever.', 'upvotes': 1}, {'author': 'Loud_Ambition3691', 'created': '2025-01-03 23:11:45', 'text': 'Think like a CEO', 'upvotes': 1}, {'author': 'ScrollValue_01', 'created': '2025-01-03 23:26:31', 'text': 'BOMB VALUES: The $100 Startup - Chris Guillebeau The Art of the Start 2.0 - Guy Kawasaki Rework - Jason Fried', 'upvotes': 1}, {'author': 'Many-Reaction-5887', 'created': '2025-01-03 23:52:32', 'text': 'In my experience, I've found that reading memoirs of real businessmen and entrepreneurs is helpful for understanding their journeys. An important consideration is their location; for instance, someone from a third-world country or a non-Western nation might glean insights from reading about figures like Warren Buffett and Steve Jobs, but the lessons may not be as applicable due to the vastly different economic conditions in the U.S. Coming from a third-world country, I found inspiration in biographies such as Sam Walton's and Steve Jobs'. However, a particularly impactful read was "Made in Korea: Chung Ju Yung and the Rise of Hyundai," which illustrated the challenges of building and running a business in Asia. It made me realize that uncertainty often outweighs the certainty we believe we have; ultimately, luck plays a role in achieving success. I believe that the best way to learn about business is through practical experience—by actually doing business. Trial and error provide invaluable lessons that are far more effective than inaction. As Nassim Nicholas Taleb suggests, it’s important to keep tinkering to gain practical insights and identify opportunities.', 'upvotes': 1}, {'author': 'leadbetterthangold', 'created': '2025-01-04 00:43:31', 'text': 'Traction Tools. Great for organization when fast growth kicks in', 'upvotes': 1}, {'author': 'bbillbo', 'created': '2025-01-04 01:04:42', 'text': 'Growing a Business - Paul Hawken Positioning - Reis and Trout', 'upvotes': 1}, {'author': 'stelmaster', 'created': '2025-01-04 01:06:23', 'text': 'How To Win Friends And Influence People by Dale Carnegie. Can’t beat the classics.', 'upvotes': 1}, {'author': 'klevis_D', 'created': '2025-01-04 01:11:12', 'text': 'Robert Cialdini - influence You can build nothing if you are not able to influence other people Marketing means influencing other people for buying what you are selling', 'upvotes': 1}, {'author': 'Honest-Parsley1737', 'created': '2025-01-04 01:28:27', 'text': '40 laws of power', 'upvotes': 1}, {'author': '02rrv', 'created': '2025-01-04 01:47:44', 'text': 'E-myth revisited is all you need to read.', 'upvotes': 1}, {'author': 'HADESsnow', 'created': '2025-01-04 01:50:46', 'text': 'Lean startup by Eric ries is a classic Also really enjoyed “turning the flywheel” from the good to great people, tiny read', 'upvotes': 1}, {'author': 'unkledell', 'created': '2025-01-04 02:11:08', 'text': 'Anything Alex Hormozi', 'upvotes': 1}, {'author': 'DesignerAnnual5464', 'created': '2025-01-04 02:51:40', 'text': 'I have read Shoe Dog by Phil Knight, it is very inspirational and gave practical advice.', 'upvotes': 1}, {'author': 'CHLarkin', 'created': '2025-01-04 03:14:06', 'text': 'Just about anything by Peter Drucker is worth reading. Under New Management by David Burkus was very good. You might have to do a little hunting for this because it's an old book, but 403 Things You Need to Know About Starting a Business is what I believe it was called. I read this as an entrepreneurial minded 7th grader in 1987, and while I don't remember everything, I remember it was chock full of good ideas and questions, easy to read, and had lots of things you need to be ready to consider. Beyond that, Bookkeeping for Dummies is a good reference for taking care of the books.', 'upvotes': 1}, {'author': 'Moist_Ear_6111', 'created': '2025-01-04 03:31:02', 'text': 'Read books of entrepeneurs or about entrepeneurs', 'upvotes': 1}, {'author': 'Brave-Rule414', 'created': '2025-01-04 03:41:09', 'text': 'From the perspective of an early-to-mid stage entrepreneur, Ive really come to appreciate Dale Carnegie’s How to Win Friends and Influence People over the years. I recognize it’s not a traditional business book, but the insights it’s given me into human behavior and relationship-building have been invaluable for my personal entrepreneurship journey. More specifically, understanding how to connect with people—whether they’re current or prospective customers, employees or vendors—has been a game-changer IMO. Other solid reads I’ve enjoyed: • ⁠The Lean Startup by Eric Ries (great for testing ideas and learning how to not get strung up on perfection) • ⁠Atomic Habits by James Clear (for building discipline)', 'upvotes': 1}, {'author': 'damascus1023', 'created': '2025-01-04 04:02:21', 'text': 'aesthetic intelligence by pauline brown. good perspective', 'upvotes': 1}, {'author': 'Freckled_Scot982', 'created': '2025-01-04 05:28:30', 'text': 'Steven Bartlett - Diary of a CEO 👍', 'upvotes': 1}, {'author': 'mmaz11', 'created': '2025-01-04 05:46:01', 'text': 'i don’t see anybody recommending them here.. but from my and many people’s experience Alex Hormozi’s both books are brilliant. ($100M Offers and $100M Leads) both very technical and simply written, often with imagery included. if that bothers you then look elsewhere, but only true masters can explain something complex in simple ways. also, i’ve been hearing a lot that the third book is coming this year ($100M Money Models)', 'upvotes': 1}, {'author': 'bootking212', 'created': '2025-01-04 08:14:11', 'text': 'There are many books but i think now its more easy to observe entrepreneurs life the way they share online and get in touch with those people. Make sure to keep people with generational wealth separate in case you aren’t the one but if you are then consider them first. If you do not want to struggle with this approach than, here are some books i will recommend: The 4hour work week and “This is marketing” by seth godin', 'upvotes': 1}, {'author': 'Potential-Shake4688', 'created': '2025-01-04 08:20:44', 'text': 'Lee Iacocca’s autobiography is worth a read!', 'upvotes': 1}, {'author': 'fainishere', 'created': '2025-01-04 10:22:46', 'text': 'There are a few ok books that people talked about here, but mostly "fake" ones. Read only books that the author has credibility, that means they either IPO’d (so you can see financials publicly) or they had big investors backing their business which was also showed publicly. For an example, I trust zero to one because I can see the credibility of Peter through PayPal as they IPO’d, for people like Alex Hormozi on the other hand, I see one private equity round and that’s it. Only he can tell us what he did, so I stay away from that. Because of this I stick to philosophy, psychology, sociology, and books about my industry. I think knowing the fundamentals of people is much more important than trying to “speed run” an MBA.', 'upvotes': 1}, {'author': 'WalrusNo6032', 'created': '2025-01-04 11:17:42', 'text': 'Pattern Breakers by Mike Maple's Jr. \- teaches about what startup ideas win by changing the rules and disorienting the competition. \- how to look for these ideas, finding a team, creating a hyper loyal fanbase, and overall creating a movement. The book has great core principles but I don't think anyone needs to read the entire thing. If you get the idea - which is powerful - then move on. the book just goes into detail on each principle, which most of the time is obvious.', 'upvotes': 1}, {'author': 'whitesoul23', 'created': '2025-01-04 11:56:55', 'text': 'Seven sources of opportunity - Peter Drucker Rules for Revolutionaries - Guy Kawasaki Oldies, but goodies', 'upvotes': 1}, {'author': 'Blissful524', 'created': '2025-01-04 12:15:37', 'text': 'Think and Grow Rich - by Napoleon Hill', 'upvotes': 1}, {'author': 'Waste_Ad6356', 'created': '2025-01-04 13:03:00', 'text': 'Definitely Oversubscribed and Key Person of Influence by Daniel priestly for me', 'upvotes': 1}, {'author': 'Stallard-17', 'created': '2025-01-04 13:50:56', 'text': 'Shoe dog although a biography is pretty raw and shows the unglamorous 99% side of entrepreneurship. If you read about the sleepless nights, poor quality products, lawsuits and betrayals and you still want to start a business then you should be alright.', 'upvotes': 1}, {'author': 'Common_Sport_3416', 'created': '2025-01-04 13:56:35', 'text': 'I've read rich dad poor dad and I think it's worth it', 'upvotes': 1}, {'author': 'donutplay247', 'created': '2025-01-04 14:18:04', 'text': 'I really liked Zero to One. Along with that, I’ve read books like Shoe Dog and Steve Jobs: The Man Who Thought Different. I find it inspiring to learn about the founders themselves—the challenges they faced, how they overcame them, and it serves as a reminder that success takes time and a lot of energy.', 'upvotes': 1}, {'author': 'themicrosaasclub', 'created': '2025-01-04 14:25:43', 'text': 'Here’s a shortlist of entrepreneurship books that deliver real value: 1. **The Lean Startup by Eric Ries** For understanding how to test, iterate, and build a business efficiently. 2. **Zero to One by Peter Thiel** A deep dive into creating something truly unique and avoiding competition. 3. **The Hard Thing About Hard Things by Ben Horowitz** Raw, unfiltered advice on handling the toughest challenges in business. 4. **Shoe Dog by Phil Knight** An inspiring story of Nike’s journey, packed with lessons about resilience and risk-taking. 5. **Rework by Jason Fried & David Heinemeier Hansson** Counterintuitive yet practical insights on building businesses differently.', 'upvotes': 1}, {'author': 'simonpittceo', 'created': '2025-01-04 14:28:28', 'text': 'The E-Myth Revisited Dot Com Secrets $100M Offers $100M Leads many more.', 'upvotes': 1}, {'author': 'AllUrUpsAreBelong2Us', 'created': '2025-01-04 15:01:36', 'text': 'Zero to One, it kicks you in the balls. At least it did me.', 'upvotes': 1}, {'author': 'united-chemical-corp', 'created': '2025-01-04 16:01:04', 'text': 'Love this topic. I recommend these to everyone who works for me and have the biggest influence on how I approach my business: Here are some grouped by author and subject matter: Jim Collins - probably my favorite or core set of books about building organizations - Entrepreneurship 2.0 - Good to Great - Built to Last - this is my bible - Great by Choice Jocko Willink - Former Navy Seal, excellent leadership principles - Extreme Ownership - Dichotomy of Leadership - this acts as a supplement/follow up to the previous Books on Management: - High Output Management by Andy Grove - one of the best books on Management by arguably the best manager of our lifetime - Measure What Matters by John Doer - book on OKRs pioneered by Andy Grove and utilized at Google Drive by Daniel Pink - study based argument about what motivates people/employees most effectively Additional books: - Start with Why by Simon Sinek - great book about organization, communication and leadership - The E Myth (mentioned quite a bit) - great on building the processes of your organization TLDR on all these books - hire well, build a culture, communicate openly and clearly, treat employees well, hold everyone accountable and with some luck you will build a highly successful organization.', 'upvotes': 1}, {'author': 'marrthecreator', 'created': '2025-01-04 16:44:54', 'text': 'The 4 Hour Work Week. It always gets a lot of hate because of the title and a lot of people find the author to be polarizing BUT that book changed the way I look at business and life.', 'upvotes': 1}, {'author': 'THOTH-Process-System', 'created': '2025-01-04 16:45:09', 'text': 'The Prosperity Bible', 'upvotes': 1}, {'author': 'armchairphilosipher', 'created': '2025-01-04 17:35:37', 'text': 'I liked 'The personal MBA'', 'upvotes': 1}, {'author': 'Inf0rm4tix', 'created': '2025-01-04 03:19:24', 'text': 'Mom Test by Rob Fitzpatrick Understand how to find real problems and get even your mother to give honest feedback by asking questions the right way to avoid fluff.', 'upvotes': 1}, {'author': 'rug_muncher_69', 'created': '2025-01-03 19:07:39', 'text': 'zero to one peter thiel', 'upvotes': 0}, {'author': 'coolrebel333', 'created': '2025-01-03 20:46:03', 'text': 'Rich Dad Poor Dad by Robert Kiyosaki is the best! Also, The Wealthy Barber. Donald Trump's books are not good at all. Also, The Millionaire Mind is good too!', 'upvotes': -3}, {'author': 'Specialist_Key6832', 'created': '2025-01-03 18:46:50', 'text': 'My personal list The triumph of optimist Stock for the long run The little book of common sense investing The founder dilemma Power phone script The complete book of phone script From zero to one Get rich with dividend Dividend still don’t lie The SAAS playbook Buy then build', 'upvotes': 0}, {'author': 'Acceptable-Anybody33', 'created': '2025-01-03 19:14:33', 'text': 'I quite enjoy Alex Hormozi’s books.', 'upvotes': 0}, {'author': 'iamzamek', 'created': '2025-01-03 20:57:05', 'text': 'How to get rich', 'upvotes': 0}, {'author': 'Lucidcranium042', 'created': '2025-01-04 00:57:34', 'text': 'Wait there's books for life? I just watched hours of it videos for bussiness and management from mit and Harvard and brown and Yale and khan. Then read a ahit ton of sycology and marketing and things of those nature's since all of that makes up what yall label as entrepreneurs. The inly main book you'd need to observe for " entrepreneurship" woukd be the acres of diamo ds - [acres of diamonds](https://www.thriftbooks.com/w/acres-of-diamonds_russell-h-conwell/492841/item/12314338/?utm_source=google&utm_medium=cpc&utm_campaign=pmax_high_vol_scarce_under_%2410&utm_adgroup=&utm_term=&utm_content=&gad_source=1&gclid=Cj0KCQiAst67BhCEARIsAKKdWOnOjw7JUmA4jKoQCANBPvUgc6hbDrZ9jh1TDGbI7UPEaOoSRnuqzJsaAj0AEALw_wcB#idiq=12314338&edition=6198307)', 'upvotes': 0}, {'author': 'happyjj24', 'created': '2025-01-04 03:00:58', 'text': 'Mom test', 'upvotes': 0}, {'author': 'OkRoger3373', 'created': '2025-01-04 04:43:29', 'text': '"Zero to one " by Peter thiel', 'upvotes': 0}, {'author': 'Possible_Media_766', 'created': '2025-01-04 05:58:19', 'text': 'My list: - Zero to one - Lean startup - Rich dad poor dad', 'upvotes': 0}, {'author': 'DHC_United', 'created': '2025-01-04 07:04:31', 'text': 'Mom test is very solid', 'upvotes': 0}, {'author': 'Automatic-Wolf-3028', 'created': '2025-01-03 19:16:21', 'text': 'I tried reading a few. Read some part of zero to one by peter thiel. And stopped reading the lean startup after few pages. They have good content. Still I don't know why i think the info isn't going to benefit me that much. Discipline and do it attitude over motivation and theory is what i believe in.', 'upvotes': -1}, {'author': 'Freckled_Scot982', 'created': '2025-01-03 20:27:10', 'text': 'Currently reading Codie Sanchez's book called Main Street Millionaire and she talks about the failures she's made in business and what she did to rise above the mistakes to become a successful business woman.', 'upvotes': -1}, {'author': 'Lusper-mh', 'created': '2025-01-03 22:00:40', 'text': 'rich dad poor dad, millionare fast lane', 'upvotes': -1}, {'author': '[deleted]', 'created': '2025-01-03 18:40:52', 'text': '[removed]', 'upvotes': -8}, {'author': 'twig1107', 'created': '2025-01-03 19:07:28', 'text': 'I cannot tell you how many times I’ve used the e-myth concepts to explain why an individual or organization is ineffective.', 'upvotes': 38}, {'author': 'drhindsight95', 'created': '2025-01-03 21:19:49', 'text': 'Many people recommend books like Zero to One or The Lean Startup, and while these are excellent, I believe these three books have a greater impact on shaping how you think. One particularly insightful idea from one of the 2 books (can't remember which one) is about pricing strategies. It explains that businesses typically succeed by focusing on either low-cost products sold at scale or high-cost products/services sold in low volumes, often directly by the CEO. However, trying to build a business in the middle—where products are too expensive to scale without a sales team but not expensive enough to justify one—creates a challenging “black hole” where growth becomes extremely difficult.', 'upvotes': 16}, {'author': 'ichfahreumdenSIEG', 'created': '2025-01-03 20:26:24', 'text': 'What version of “The E Myth?” There’s like a million of them for enterprise, revisited, small business, attorney, physician, mastery etc.', 'upvotes': 11}, {'author': 'Katya-YourDad', 'created': '2025-01-04 03:20:08', 'text': 'Jumping on the top comment to ask about ones specifically for starting a venture- like financing tips. I have an MBA but didn’t really take entrepreneurship courses', 'upvotes': 2}, {'author': 'Defiant_Flatworm8281', 'created': '2025-01-03 22:29:41', 'text': 'This! The moment they’re selling a face, they’re doing it for fuckery to essentially be an influencer', 'upvotes': 9}, {'author': 'reddited70', 'created': '2025-01-04 18:17:01', 'text': '+1 for Disciplined Entrepreneurship. His worksheets are really good.', 'upvotes': 1}, {'author': 'probsunderqualified', 'created': '2025-01-03 21:06:46', 'text': '100% agree', 'upvotes': 4}, {'author': 'themicrosaasclub', 'created': '2025-01-04 14:26:40', 'text': 'one of the best books on this list. The only book i have kept.', 'upvotes': 2}, {'author': 'simonpittceo', 'created': '2025-01-04 14:52:03', 'text': 'yeah i listened to the audiobook, quite long but solid points sprinkled within.', 'upvotes': 1}, {'author': 'v0lume4', 'created': '2025-01-03 22:48:33', 'text': 'The Millionaire Fastlane is GOATed.', 'upvotes': 16}, {'author': 'TheMailmanic', 'created': '2025-01-03 19:24:31', 'text': 'His recent books are very ranty on jobs but otherwise yea solid choice', 'upvotes': 5}, {'author': 'ClickDense3336', 'created': '2025-01-03 23:28:48', 'text': 'first one is the best, unscripted has a lot of good stuff in it if you skip the stories and rants, but the latest is just too much. When he talks about jobs he just goes way too far, disparaging culture, America, 9-5's, everything. It is a bit too much. If you build a real business, you're likely going to need structure and order. You will also likely hire employees. The 9-5 workweek is not a bad thing, it's actually very important. Best quotes on entrepreneurship go the opposite direction: you give up your 9-5 job for a 24/7 job.', 'upvotes': 2}, {'author': 'RetroIsFun', 'created': '2025-01-04 14:52:25', 'text': 'Millionaire Fastlane is the best entrepreneurial book I've ever read. The second and third books are just the author going on political/social rants. I love the guy and what he's done and the community he's built but I really can't recommend those follow up books at all.', 'upvotes': 2}, {'author': 'JPadelG', 'created': '2025-01-03 18:25:38', 'text': 'Unpopular opinion. No one can suggest a book. It’s like you just gotta find what works for you.', 'upvotes': 21}, {'author': 'ClickDense3336', 'created': '2025-01-03 23:30:25', 'text': 'real estate books are fun but they're all the same it's called napkin math for a reason', 'upvotes': 1}, {'author': 'pineapple_26', 'created': '2025-01-04 08:52:02', 'text': 'Agreed Jason Fried & David HH from 37 Signals/Basecamp have written some pretty inspiring stuff - often counter to the usual “growth at all costs” approach that many startups take', 'upvotes': 1}, {'author': 'probsunderqualified', 'created': '2025-01-03 21:07:52', 'text': 'world-class rec that', 'upvotes': 2}, {'author': 'Ok-Sympathy-9744', 'created': '2025-01-04 10:36:19', 'text': 'This was actually so good and since reading this book I can see it in real life practices all the time.', 'upvotes': 1}, {'author': 'Ss_uleman', 'created': '2025-01-03 22:08:10', 'text': 'Is this chatgpt reply? Because i did got the same reply, from chatgpt', 'upvotes': 9}, {'author': 'KazeCamerado', 'created': '2025-01-03 21:06:29', 'text': 'Traction has so many hands on tools and practices - it really changed my worklife for the better. I've given it to so many people.', 'upvotes': 6}, {'author': 'SuperCl4ssy', 'created': '2025-01-03 18:43:02', 'text': 'Am I the only one that finds Millionaire Fastlane kinda cringey? I’ve tried to read it twice and just can’t stand it, feels like someone is constantly selling me something', 'upvotes': 5}, {'author': 'Staroson', 'created': '2025-01-03 18:38:52', 'text': 'Second this. Dude's aura can be offputting to some with the gym bro look and nose strips but he knows his stuff', 'upvotes': 10}, {'author': 'Feisty_Attorney_3811', 'created': '2025-01-03 20:46:42', 'text': 'I second this as well. His stuff is straight-to-the-point and super logical, no fluff. He also has free audiobooks available on his podcast if you don't want to buy the book.', 'upvotes': 2}, {'author': 'foundout-side', 'created': '2025-01-03 20:46:58', 'text': 'seconding this, 100m offers changed our business dramatically', 'upvotes': 1}, {'author': 'sevenquarks', 'created': '2025-01-03 22:53:29', 'text': 'He is a grifter. Ignore his books and videos.', 'upvotes': 2}, {'author': 'Available_Ad4135', 'created': '2025-01-03 20:52:24', 'text': 'Bit of a shame how quickly he went from: “I’m an investor now, I’ll never sell you anything.” To: “Here’s my course, that’ll be $5K please.” According to their [website](https://acquisition.na.teamtailor.com/jobs/67368-senior-sales-representative), each sales rep is supposed to see *at least* 80 of these $5K course per month. Good at business alright!', 'upvotes': 1}, {'author': 'Creepy_Challenge_338', 'created': '2025-01-04 14:29:40', 'text': 'Is it a high standard book that is applicable?', 'upvotes': 1}, {'author': 'glorfiedclause', 'created': '2025-01-04 13:48:16', 'text': 'Profit first is a short and powerful book that needs to be read and implemented early. It’s a nightmare of information to teach someone to navigate later in the game.', 'upvotes': 1}, {'author': 'sevenquarks', 'created': '2025-01-03 22:53:48', 'text': 'She is a grifter.', 'upvotes': 2}, {'author': 'tuck72463', 'created': '2025-01-03 18:49:58', 'text': 'Who is the author?', 'upvotes': 2}, {'author': 'itzmarabella1', 'created': '2025-01-03 18:54:22', 'text': 'I second this, I saw their videos on Snapchat a couple months ago, very bizzare place to advertise but it seemed to work, the amount of knowledge I gained from their ebook and community was unparalleled, I definitely recommend this!', 'upvotes': -2}, {'author': 'mhonore', 'created': '2025-01-03 19:42:06', 'text': 'I agree. What was your pivot once your understood that? How do you guide others?', 'upvotes': 10}, {'author': 'simonpittceo', 'created': '2025-01-04 14:28:45', 'text': 'The Lean Startup is a good book.', 'upvotes': 1}, {'author': 'eric8989', 'created': '2025-01-03 20:37:09', 'text': 'I read the main "E-Myth revisited" and it was great. Tons of useful concepts that will mostly likely be valuable to your business. I haven't read any of the job-specific versions but definitely worth a look if they apply to you.', 'upvotes': 11}, {'author': 'drhindsight95', 'created': '2025-01-04 09:00:01', 'text': 'I'm not sure about the question you have. For example let's say you have a wholesale business. You have 1200€ income/year. To operate this business you'll need stock. Let's say 3 months. You pay half your supplier in 30 days rest prepayment. You have customers who pay for 30 days on avg. Let's say you double your business or triple. And you have a 20% margin on each sale (10% profit). So your business will generate 120€ each year. You can easily calculate that it won't be enough to cover your growth. I'd start calculating this way in my business model. Let's say you have a retail company. And same case. You can calculate that because people pay immediately and you have 30 days to pay your inventory (and most likely you won't need 3 months of stock from every SKU) you'll need way less money to scale the business and it's easier to grow feasibly. I'd start with this but canvas model helps a lot understanding these parts of your business throughout the year. For example: you have a retail chain and most of the companies you compete with have amazing trade marketing incomes and strategy, but you have nothing in this field. Let's say you'll ask money for each new products for newsletter, social posts etc. In this case it might turn out that because of your business modell you can't to the same as your competitors (for example: working with special products from farmers, asking for larger margins from suppliers than competition since the transparent operation you have (and no after/hidden fees).', 'upvotes': 3}, {'author': 'Dizzy_Orchid_5246', 'created': '2025-01-04 00:12:04', 'text': 'Id agree except for felix dennis’s how to get rich and bill bartmann’s books', 'upvotes': 1}, {'author': 'compoundinterest00', 'created': '2025-01-04 02:17:18', 'text': 'Interest reads a book. Commitment applies the book 50x over. Love that line what a legend', 'upvotes': 9}, {'author': 'Peepeepoopoobuttbutt', 'created': '2025-01-03 18:34:34', 'text': 'Yep', 'upvotes': 4}, {'author': 'BillySavery', 'created': '2025-01-04 08:54:31', 'text': 'Yes, I can’t stand all that growth shit people write about and tbh I’m not a massive book reader but their book was V clean, had good visuals and was so easy to read.', 'upvotes': 1}, {'author': 'Ausiir63', 'created': '2025-01-04 11:45:52', 'text': 'A real classic imo.', 'upvotes': 2}, {'author': 'InYoYingus', 'created': '2025-01-04 02:14:18', 'text': 'EOS is a game changer.', 'upvotes': 3}, {'author': 'WalrusNo6032', 'created': '2025-01-04 11:09:35', 'text': 'Yes and also no. The first 1/2 is tough to read - cringey, redundant, long. But in the second 1/2 there's a lot of gold nuggets of wisdom. It's not the best book for hands on knowledge, but it really hones anyone's perspective on all reasons why the "fast lane" is a no brainer (especially today) rather than picking the "slow lane". I think it's far better than Rich Dad Poor Dad, or any other 'intro to getting rich' book. Even if you're already an entrepreneur or know the stuff, it's a motivating read.', 'upvotes': 1}, {'author': 'TheMailmanic', 'created': '2025-01-03 19:24:01', 'text': 'Mj is ironically not trying to sell anything other than a few books I guess. He is already successful. He doesn’t sell any courses or other products', 'upvotes': 1}, {'author': 'mymindset_com', 'created': '2025-01-04 00:00:46', 'text': 'But why do you think this?', 'upvotes': 1}, {'author': 'Big_MD', 'created': '2025-01-04 03:00:57', 'text': 'Literally could not be further from the truth. I have personal direct experience with him and his team and they provide tremendous value and are very good at what they do.', 'upvotes': 1}, {'author': 'mymindset_com', 'created': '2025-01-04 00:00:17', 'text': 'Not really. He gives everything for free away. If you want a hard copy of course you do. But check his podcast. Literally gives you the audiobooks for free', 'upvotes': -2}, {'author': 'Big_MD', 'created': '2025-01-04 03:00:09', 'text': 'Its not a $5k course but an actual in person workshop at their office in Las Vegas. I went and found it incredibly beneficial. It led to some major fundamental changes that catapulted my business. He goes into the their thesis on why they started that workshop model. 1. SO MANY PEOPLE were asking for help, why not charge for it?? If people wanna pay then collect that money they make over $1m for every work shop. 2. Their portfolio companies that have performed the best are ones that they have directly helped before acquisition. By having a workshop that brings businesses directly into their sphere and helping grow their systems with their expertise, then any companies they acquire that go through that process SHOULD perform better. TLDR: Ya they make money, good for them they provide tremendous value.', 'upvotes': 2}, {'author': 'Brandutchmen', 'created': '2025-01-03 18:53:18', 'text': 'This is an ad. Check profile', 'upvotes': 2}, {'author': 'twig1107', 'created': '2025-01-03 23:35:03', 'text': '9/10 times that an org is failing or stagnating or corporate or individual morale is tanking, its because they have a misalignment b/w people’s native personalities (worker/manager/visionary) and their job position. Ex: make a visionary a hole digger and he will become a cancerous super cynical employee. Make a manager a CEO and they will stagnate; make a worker a manager and the other workers will quickly become a disorganized mess. These skills can be learned, but that becomes an active choice for the individual.', 'upvotes': 38}, {'author': 'ichfahreumdenSIEG', 'created': '2025-01-03 20:59:32', 'text': '😁🙏', 'upvotes': 1}, {'author': 'SuperCl4ssy', 'created': '2025-01-04 12:53:19', 'text': 'Okay, thanks for feedback. I’ll try to skip few pages here and there next time', 'upvotes': 1}, {'author': 'FreeSpirit3000', 'created': '2025-01-03 19:53:40', 'text': 'He sells premium membership of his forum.', 'upvotes': 3}, {'author': 'Available_Ad4135', 'created': '2025-01-03 20:56:03', 'text': 'If ‘he’s already successful, he doesn’t need to’ played out in real life, we probably wouldn’t have a US president selling pieces of an old suit and knock off Chinese watches. Or the world’s richest man desperately trying to take over the earth. Turns out for some people, having it all is never enough. 🤷🏻‍♂️', 'upvotes': 2}, {'author': 'Available_Ad4135', 'created': '2025-01-04 04:56:34', 'text': 'That’s great. Obviously, there is no issue with training in principle. I just didn’t like the U-turn from “we’ll never sell you something” to selling books and courses a few months later. It felt like manipulation and completely switched me off. I don’t know what point 2 really means? They already help accelerate the companies they invest in, don’t they? That was supposed to be their business model. It just sounds like a sound bite to me. What were the changes you made in your own business after the workshop?', 'upvotes': 1}, {'author': 'vsamma', 'created': '2025-01-04 15:13:08', 'text': 'Okay but how do I know which type I am and which role suits me best? I feel there are misalignments in my company in many levels but I can’t define who is what type.', 'upvotes': 4}, {'author': 'TheMailmanic', 'created': '2025-01-03 21:04:15', 'text': 'Oh really I wasn’t aware of that', 'upvotes': 1}, {'author': 'Dizzy_Orchid_5246', 'created': '2025-01-04 00:47:34', 'text': 'His forum has been live for like 15 years and he only started charging premium a few months ago due to an influx of trolls, and btw recently said you don’t have to continue paying if you’ve proven your value.', 'upvotes': 1}, {'author': 'TheMailmanic', 'created': '2025-01-03 21:04:32', 'text': 'lol true.', 'upvotes': 1}, {'author': 'Big_MD', 'created': '2025-01-04 10:59:09', 'text': 'So at the workshops they very directly work with you to solve problems in your business. It's not just "here's information good luck" like all their media but his whole team is like "if we were owners of your company we would do X, Y, Z". In mine I completely reformatted my customer success journey which was the biggest thing. Then made lots of changes to how we're were handling our data and KPIs which really helps us make better decisions. Lots of great tweaks to our sales process specifically around how we structure/pitch our offer and how we follow up with prospects. And it all came from direct one on one conversations and direction from the team and even Alex and Lela directly.', 'upvotes': 1}, {'author': 'FretlessChibson', 'created': '2025-01-04 18:25:53', 'text': 'Have you read the book? It’s great', 'upvotes': 1}, {'author': 'scithe', 'created': '2025-01-04 03:06:21', 'text': 'I'm pretty sure there has been an optional premium membership for years. My account was created Oct 31, 2018 and I just logged in and apparently if I don't upgrade, my account will be deleted in 7 days.', 'upvotes': 1}, {'author': 'vsamma', 'created': '2025-01-04 18:27:24', 'text': 'No, just found out about it from here. But i guess you have to be sharp enough to match the theory with practice. How would I know if someone makes a good manager? Or which one of his team members are a visionary?', 'upvotes': 1}], 'id': '1hsx77c', 'num_comments': 174, 'text': 'What books are actually good?', 'title': 'What entrepreneurship books are actually legit?', 'upvotes': 332, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1hsx77c/what_entrepreneurship_books_are_actually_legit/'}, {'comments': [{'author': 'ChefFar4397', 'created': '2025-01-04 01:46:40', 'text': 'Very close colleague recently sold molding and tool making company (not at all talking hammers or screwdrivers) to very large medical company. Have close contacts that handle all aspects of engineering cnc cam and techs as well. Can’t say this loud enough - 100% get NDA and use US talent so it’s binding. There are other precautions you may want to take as well. Anything can be reversed engineered. Being first matters. Feel free to dm - will give direction if I can.', 'upvotes': 31}, {'author': 'SkullRunner', 'created': '2025-01-04 01:49:21', 'text': 'If you don't want your product knocked off you need to find a domestic manufacturer bound by laws you can enforce. The moment you send your design files to be produced in China your product will be produced and sent back to you while also appearing on Temu etc. shortly after if your product has any practical marketability. NDAs, contracts, non-competes don't mean anything if you're living outside of China and doing business with them, they can just take the design patented or not and run as is common place. Would strongly recommend get a patient for your item if it's unique. Find a CAD pro that is in the same country as you and do have them sign a NDA / Contract that the output of the project is legally owed by you, not them and that upon completing they are to destroy their copies of the working files etc. Then try to get the item produced in your country which allows you to go after them if they were to produce the item themselves. Eventually a knock off from China may emerge if your product is of value, but you slow it from showing up on their radar to steal and they don't start with factory with your original design files and molds etc. you paid for making it easy for them to do.', 'upvotes': 11}, {'author': 'Muted-Ad-6637', 'created': '2025-01-04 06:20:35', 'text': 'NDA with a China based entity doesn’t help you at all.', 'upvotes': 5}, {'author': 'Bzom', 'created': '2025-01-04 03:02:54', 'text': 'There's some good advice in this thread. But here's something I'd always keep in mind. I'd much rather work with someone I can trust with no NDA, then someone I don't trust with an NDA. That doesn't mean don't get an NDA - it means don't rely on it. It's only worth your ability to enforce it, and suing a freelancer with no assets isn't gonna get you anywhere. Any competent professional is going to treat your data the same (confidentially) whether they signed anything or not. That's what you really care about. Someone who is sloppy and careless with your data is going to happily sign your NDA without even reading it.', 'upvotes': 4}, {'author': 'RossDCurrie', 'created': '2025-01-04 09:29:21', 'text': 'The main thing about any kind of legal agreement is - if you can't enforce it, it's not worth anything. Let's say your guy on Fiverr signs an NDA then turns around and publishes everything you send them as a reply on this post. It's out in the world. They're in breach. What do you do now? Sue them? With what lawyers? Maybe the team at RocketLawyer can help you find a lawyer. What will you pay the lawyers with? Do you have the funds for a protracted legal battle, to win... well, IANAL but I can't imagine you'd be awarded more than the $5 you pay them. What are damages like for breach of NDA for a company that is just starting out? I mean, I know you've got a bazillion dollar idea and all, but can you prove that to a court's satisfaction? And... Good luck finding CadFiverrGuy22 to sue him. Everyone says, "if your product becomes popular, you'll get knocked off by China". And that's true enough - but **worry about getting popular first.** I really can't stress that enough. I help out at an annual entrepreneurship program here in Aus, and everyone seems to think they're going to get knocked off. The sheer amount of time they spend worrying about this far outstrips the amount of time they spend worrying about execution. My relevant experience: Squishy Forts.', 'upvotes': 4}, {'author': 'OlicusTech', 'created': '2025-01-04 04:11:40', 'text': 'Tech & Gaming hardware company owner here. I would highly recommend an NDA when people working with your product. (It’s also a standard in the industry). A party that says no to an NDA in manufacturing and Engineering is not considered serious. It’s often time no issues, engineering companies often have their own strict rules not to share any detail about the projects and same with manufacturer but it’s always good to have. NDA is a very simple contract and I would highly recommend you to use it. When it comes to China, it don’t really matter if you have patents, legal documents etc. It still always good to have them. I would more focus their on building relationships and trust between you. In my experience Chinese manufacturer value building long lasting relationships, try to build it with ”their” culture. But if you manufacturer in China you can almost count that your product will be manufactured in other places with copies. (Look at most products there is always copies on the market). Most companies protect it so the copies are not allowed to be sold in their market (often western world). Because they can’t really stop the copies to be manufactured but they can control some what how they are sold.', 'upvotes': 3}, {'author': 'IndependentAlarm788', 'created': '2025-01-04 05:08:24', 'text': 'For the CAD designer: Yes, use an NDA (RocketLawyer is fine) since they'll need full product details to create accurate designs. For the Chinese manufacturer: An NDA would be complex to enforce in China and likely not worth the effort. Your current approach of limiting information is smart. Focus instead on building a good relationship with a reputable manufacturer.', 'upvotes': 2}, {'author': 'abhinav4703', 'created': '2025-01-04 08:53:03', 'text': 'Even if you manufacture locally and don’t give your CAD files to Chinese manufacturers,they will reverse engineer and beat you with price if your product becomes even slightly popular. It’s inevitable', 'upvotes': 2}, {'author': 'Escal0n', 'created': '2025-01-04 09:25:24', 'text': 'Be honest to yourself about who you are and what you represent. Are you a small indie hacker working alone with an idea or design? Or are you representing significant money with something highly proprietary. There are billions of people on this earth, and anyone believing they have something groundbreaking that nobody thought of, is most likely kidding themself and sacrificing their idea to compliance, paranoia and lack of feedback. (Read: most likely) Try to be truly honest to yourself, and remove bias and yourself from the equation. I noticed that you also (intentionally or not) left out any design indications from this post. The risk of inferior products and designs, as a result of paranoia and lack of feedback, is far greater than the risk of knock offs. And few people prefers working with nda-obsessers unless you are representing serious money or ingenuity. So just be honest to yourself. If you’re an independent with the next fidget spinner, then don’t bother and start moving fast instead.', 'upvotes': 2}, {'author': 'Lagbert', 'created': '2025-01-04 10:03:26', 'text': 'A note about finding a CAD operator. Don't use Fiverr. Call your local solidworks VAR and ask them for a list of their clients that are freelancers or design firms. This is a quick easy way of weeding out CAD operators that are using free versions of Fusion 360 or Onshape to run a side hustle. If a CAD operator is willing to layout $4000 for the base level of software, they are more likely to be a professional.', 'upvotes': 2}, {'author': 'Res_Con', 'created': '2025-01-04 10:14:55', 'text': 'Tl;Dr: Don't worry about NDAs, just get the damn thing made. No manufacturing company doing CNC milling on 2k of the components of your doo-dad has the marketing, shipping, fulfillment, packaging, advertising to do ANYTHING to either compete with you or spoil your show. Unless you've invented some earth-transformational (yet simply machinable) thing you've jack-sh&@ to worry about. People are just swimming in their self-important fantasies and wasting money energy and time.', 'upvotes': 2}, {'author': 'stackmatix', 'created': '2025-01-04 11:52:12', 'text': 'Yes, it's a good idea to send an NDA to both the CAD designer and the manufacturer. While an NDA in China may not be fully enforceable without translation, it still offers protection and sets clear expectations. Be cautious with the details you share early on.', 'upvotes': 1}, {'author': 'themicrosaasclub', 'created': '2025-01-04 14:23:41', 'text': '**1. For the Fiverr CAD Designer:** Yes, sending an NDA is a smart move. While most Fiverr designers are professional, it’s best to protect your intellectual property. Make sure the NDA specifies that the design is confidential and cannot be shared or reused. Fiverr also has terms to support your ownership of work done, but an NDA adds an extra layer of protection. **2. For the Manufacturer:** You’re correct that Chinese contracts must be written in Chinese to be enforceable. If your product is truly unique, consider consulting a professional experienced in Chinese law to draft a bilingual NDA. Otherwise, continue withholding critical details until you’re further along in the relationship. Often, the biggest risk isn’t a manufacturer stealing your idea—it’s them sharing it with other clients or making knockoffs. A clear contract can help mitigate this. **3. General Advice:** * Only share the minimum details necessary to move forward. * Vet your Fiverr designer by checking reviews and portfolios. * If your idea is highly innovative, consider filing for a provisional patent to give you some early protection while working out details. Remember, it’s better to invest in safeguards upfront than regret being too trusting later.', 'upvotes': 1}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 01:55:38', 'text': 'Thanks for the advice. I used AliBaba initially to look for manufacturers because of how easy it is to look for and find a manufacturer who can make a specific product. However from what I’m seeing it looks like almost all of the manufacturers on AliBaba are Asia based. To find U.S. based manufacturers would you recommend just googling and emailing manufacturing factories and seeing if they can make my product after signing an NDA?', 'upvotes': 4}, {'author': 'Bzom', 'created': '2025-01-04 02:50:38', 'text': 'All good except the advice to delete files. If you hire someone you feel the need to request this from, hire someone else. Professionals don't operate by regularly deleting data. Clients come back for changes, manufacturing improvements, iterations, etc.', 'upvotes': 5}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 02:02:45', 'text': 'Thank you for your advice. Do you have any recommendations for how to find good and reliable suppliers in the U.S.? AliBaba seems to show almost exclusively Asia based manufacturing factories. Do you think Googling manufacturing factories in the U.S. and emailing them is the best way to find reliable manufacturers or is there a better way?', 'upvotes': 1}, {'author': 'RossDCurrie', 'created': '2025-01-04 09:14:10', 'text': 'When I toured the factory I was going to use, they showed me a bunch of products they could make for me that they couldn't put on their alibaba listing because they'd signed NDAs.', 'upvotes': 2}, {'author': 'Res_Con', 'created': '2025-01-04 10:07:02', 'text': 'FINALLY someone in this thread has some sense. The ^^^ multi-paragraph diatribes are...making their owners feel warm and fuzzy is about the only thing? And to the OP - how many components are in your final product? How localized is your market? How much of a distro network does it need to fulfill? All these questions matter to determine if NDAs have ANY use at all? Chances are, they're irrelevant and China is wide open to make your thing. Just make it at a few subcontractors so not any one has all the components.', 'upvotes': 1}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 04:07:57', 'text': 'Thank you for this advice.', 'upvotes': 1}, {'author': 'Res_Con', 'created': '2025-01-04 10:08:43', 'text': '<slow clap>', 'upvotes': 2}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 04:13:31', 'text': 'Thank you for this information and advice', 'upvotes': 2}, {'author': 'mobius1ace5', 'created': '2025-01-04 11:11:50', 'text': 'I work in prototyping and throughout the years we have made a list of companies we liked sending clients to after additive stopped making financial sense. I would hope many shops out there like us do the same thing.. but we also do full art to part design work, scanning, and more, not just 3d printing.', 'upvotes': 4}, {'author': 'bidex6', 'created': '2025-01-04 02:36:03', 'text': 'Lurker, would love to see the answer to this', 'upvotes': 2}, {'author': 'ofCourseZu-ar', 'created': '2025-01-04 14:37:02', 'text': 'Depending on your location and the actual product materials to be used, I could recommend a few places my work uses to manufacture parts. I'm happy to help refer to these places. I think most work with metals or machinable composites, but some also do 3D printing. DM me if you're interested!', 'upvotes': 1}, {'author': 'ChefFar4397', 'created': '2025-01-04 02:40:02', 'text': 'KG - Simple answer: Simple design: prob ok locate a local shop online. Complex Design: I’d go boots on the ground to find a talented shop. My approach then is to walk in - ask for face to face with owner so you can convey not only to what your build goals are but also provides an opportunity for you to tell your story - most straight shooting legit owners like helping people get going. You’d be surprised. Out of goodwill an owner who started from the ground up may offer some concessions. Either way you’ve forged a relationship and gotten your story out there. If they can’t (too busy) or don’t want to do the work you’re more likely to get a quality referral. There a ton of other considerations - these are safe initial steps.', 'upvotes': 1}, {'author': 'SkullRunner', 'created': '2025-01-04 10:47:31', 'text': 'If you hire an agency with a contract that's true. When you hire someone on Fivver who is likely just someone working on a laptop, you can assume they do not take data security as seriously as a firm and you should get a full package of the working files with the order and ask them to delete them as part of the contact on completion. The idea is to make them legally bound that if they are a source of leak of your proprietary work or they re-use it in whole or part as a shortcut for others work you can sue them. It also protects you by having all your working files which you can send back to them if you need future revisions or need to move on to someone else because people on Fivver can just disappear at anytime and stop offering public work. There have also been cases where people have sent all sorts of digital IP like entire e-books for editing on Fivver and then found the book slightly edited or translated and released to the public on Amazon, the Fivver provider was just using the service as a honeypot to collect content and then selling the content/ideas sent in on other digital marketplaces as their own. These are the cases where you want it legally clear who owns what, how long they are allowed to retain a copy and it's clear there is consequences (in an enforceable jurisdiction) if they break any terms of the contract or use of your intellectual property.', 'upvotes': 0}, {'author': 'RossDCurrie', 'created': '2025-01-04 09:15:47', 'text': '[MakersRow.com](http://MakersRow.com) is always an option, depending on your product type. US Manufacturers', 'upvotes': 2}, {'author': 'Lagbert', 'created': '2025-01-04 09:50:48', 'text': 'Nearly every major city with manufacturing has an industrial group. For example, Minnesota has the Minnesota precision manufacturers association. Your local industrial association can often help you find members that can produce the parts you are looking for. Emailing or filing out a contact form on a website is the quickest way to get ignored. You need to phone manufacturers or meet face to face. It also helps to have a full set of prints. Manufacturers do not like quoting things without specifics. It also shows you are serious. If you've put in the time/money/effort to make viable prints, you are clearly not just a tire kicker. If your design is patentable, get a provisional patent. They are cheap, let you mark your product patent pending, and it buys you a year to file a full patent. Do you have a working prototype of your product? Is it purely mechanical? Is it electrical-mechanical? Does it need firmware or software? If you want to go the expensive route companies like whiteboard (https://www.whiteboardps.com/) exist. They can get you from concept to viable product fairly quickly, but it will not be cheap.', 'upvotes': 2}, {'author': 'zimm3rmann', 'created': '2025-01-04 10:55:12', 'text': 'More likely they don’t want to piss off those customers and continue working with them than an NDA having teeth.', 'upvotes': 1}, {'author': 'OlicusTech', 'created': '2025-01-04 04:15:44', 'text': 'No worries, also one more thing that can help you. If your product have different components you can easier protect your product with having different manufacturers for each part and then have the products shipped to you where you assembly it. This way they don’t have the complete product. Much more difficult for them to copy.', 'upvotes': 2}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 02:43:58', 'text': 'Thank you', 'upvotes': 1}, {'author': 'Bzom', 'created': '2025-01-04 15:50:11', 'text': 'Great post. No intent here to argue as I think this is excellent, but I'd like to provide a practical alternative perspective. If you're shopping on fiverr for CAD support to hire a low-cost freelancer who probably doesn't have any assets, the scenario in which actual enforcement happens is almost non-existent. So rather than optimize for legal enforcement, I think you should optimize for practical risk mitigation. The practical side is vetting who you share information with and limiting what you share to what they actually need to know, regardless of what the NDA language says. It's acting strategically with due diligence instead of relying on the perception that the NDA is doing that for them. If I'm paying someone $300 on fiverr, I need to recognize the risks associated with the transaction. If that person can disrupt my entire business by uploading a few files to the internet, I should acknowledge that risk up front. My experience is that individual inventor types often over-rely on NDA language and lack perspective on the practical aspects. They'd rather sign an NDA and over-share than simply limit information to a need-to-know kind of basis.', 'upvotes': 1}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 11:38:41', 'text': 'Thank you for this information. Yes, I have a working prototype however the prototype does not have the design that I would like the final product to have. The product is a physical product with electrical components.', 'upvotes': 1}, {'author': 'RossDCurrie', 'created': '2025-01-04 10:56:02', 'text': 'Either way it meant nothing to them.', 'upvotes': 2}, {'author': 'Kindly_Guess7290', 'created': '2025-01-04 04:31:13', 'text': 'I’ll keep that in mind when selecting manufacturers. Thanks again✅', 'upvotes': 2}], 'id': '1ht6dar', 'num_comments': 36, 'text': 'I’ve got a product idea and have messaged a China based manufacturer on AliBaba with vague details about my product excluding it’s primary use/niche to avoid giving away my product while still seeing if the manufacturers could make the product. I didn’t send an NDA to the manufacturer because I’ve seen many people say that for contracts to be valid in China, they have to be written in Chinese. I don’t know the Chinese language and if I were to make an NDA, I would use RocketLawyer because of its ease of use and good reputation from what I’ve seen. I haven’t given any information that would tell the manufacturer what my product is to be used for and it is not obvious. However, my logo and business name (which I have not shared yet) will be on the final product and packaging will give away my product’s use. The manufacturing factory manager said they could make everything listed in my initial product request message with the exception of one thing listed for which they would need to see a CAD design before they could decide if it was feasible for them to manufacture my product or not? I’ve been looking for a product CAD designer on Fiverr and was wondering if I should send tge Fiverr CAD Designer an NDA or not as I’m seeing multiple differing opinions on the internet. Also should I send an NDA to the China based manufacturer or no? Thank you.', 'title': 'Should I make a NDA for a CAD Designer on Fiverr?', 'upvotes': 83, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1ht6dar/should_i_make_a_nda_for_a_cad_designer_on_fiverr/'}, {'comments': [{'author': 'PowerUpBook', 'created': '2025-01-04 13:56:12', 'text': 'Sometimes the grass seems greener on the other side. Yea absolutely stay in touch with your waitlist personally every day.', 'upvotes': 5}, {'author': 'napogh', 'created': '2025-01-04 14:00:58', 'text': 'Look at all the ways that you can add value to them and the network & relationships will come. Then naturally your business will evolve as you learn more. Keep showing up for them everyday and you will see things will work themselves out.', 'upvotes': 3}, {'author': 'rpeg', 'created': '2025-01-04 17:52:13', 'text': 'Any suggestions on how to best reach out to them? They're just on a waiting list right now. I did reach out to one person to ask if he wants to beta test the course so far. There's so much I could learn from these folks. One of them composes for AAA video games. Another is an Emmy winning composer. These are my potential customers.', 'upvotes': 1}], 'id': '1htiiyn', 'num_comments': 3, 'text': 'I've been forced into entrepreneurship. My "career" as a part-time professor is dwindling. So now I'm focused on teaching online. I feel hopeful of what it will become in the future but I am still at early stages. I have a waitlist for what will likely become a flagship course. It's attracting really successful people in the industry and I'm surprised. I did not expect this. Here are my thoughts: * I envy their careers. Honestly, I *may* rather do what they're doing. This mindset conflicts with my entrepreneurial goals. * I'm excited that they have waitlisted and I'm wondering how to best use this information. Can I network with my customers? * How may this change my business plans? My original goal was simply to provide a course on a niche technology topic. How do I get the most out of this? What do I teach? I teach some niche creative technology topics relating to design and programming. So those are my thoughts at the moment. Have you felt this way before? Any suggestions on how to work with seemingly successful customers?', 'title': 'I'm attracting customers I would want to work with. I envy their careers.', 'upvotes': 7, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1htiiyn/im_attracting_customers_i_would_want_to_work_with/'}, {'comments': [{'author': 'Side_Prenuer', 'created': '2025-01-04 12:58:06', 'text': 'My products are digital products Yes. I started with just a 3 figure investment and I decide based on my goal and the target I want to reach out to. I decide based on the market trends and needs in the market. I did it with my 9-5 job and it works flexibly at my schedule Most of my time is spent on marketing, engagement and content creations. It does need to take some time and work but consistency to market does give results for me', 'upvotes': 3}, {'author': 'Intelligent-Snow-744', 'created': '2025-01-04 13:36:44', 'text': 'Tip As i did mine - As my first company i started at age 27 was PANGUR.CARE MY vision was to make skin care basic and sunscreen to be my main product , my first product was 3 in 1 Body oil candle , as i was a noob in markating , except all things i did to setup my first vinture was : 1. Target market ( gift , spa , hotel , and more ) 2. Your product ( 3 in one body oil candle ) for lauxury experiance of body massage oil which was a candle 3.Website - made with the help of the friend [ https://pangur.care/] 4.Delivery partner [ i choose one delivery as my parnter they doo 500 ₹ recharge and resonable charges for delivery including pick up . 5.b2b and b2c both : been selling my 3in 1 body oil candle to coustomer but as same time trying to capture b2b market as part .', 'upvotes': 1}], 'id': '1hth1v3', 'num_comments': 2, 'text': '-Is it doable with not much savings? -How did you choose the products to sell? -How did you manage to get the products that you wanted to sell for cheap enough for it to be worth it? -How time consuming is it? (Is working another job at first possible) -What were the steps you did and in what order? -Is it easy to make it profitable? Do you have any tips?', 'title': 'How did you start your e-commerce business?', 'upvotes': 6, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1hth1v3/how_did_you_start_your_ecommerce_business/'}, {'comments': [{'author': 'brucekeller', 'created': '2025-01-03 20:35:26', 'text': 'Doing it early in life is definitely better imo. At the very least you won't have to be wondering 'what if?' as much in the future. If you do fail (and don't feel bad if you do, it's an extremely tough game, especially your first time), you'll still end up with a lot of valuable education for next time. Good luck!', 'upvotes': 16}, {'author': 'BerryBerryScurry', 'created': '2025-01-03 21:01:24', 'text': 'You’re damn right. No better time than now! Just curious, are you doing it for the money, or are you doing it because you love SaaS?', 'upvotes': 8}, {'author': 'probsunderqualified', 'created': '2025-01-03 21:13:32', 'text': 'Good luck! Honestly, I’d rather live with the regret of actually *doing* something than the eternal 'what if' of never knowing.', 'upvotes': 7}, {'author': 'Arthurobo', 'created': '2025-01-03 20:34:21', 'text': 'Go for it, you’ll scale with time and consistency, just keep in mind to learn and unlearn things to serve your customers better. But curious, what saas are you building.', 'upvotes': 4}, {'author': 'Legitimate_Stock7647', 'created': '2025-01-03 21:42:12', 'text': 'Go get it! As a fellow 22 year old not interested in the 9-5, I wish you all the best!', 'upvotes': 5}, {'author': 'ImWatchingWazowski', 'created': '2025-01-03 21:43:12', 'text': 'Burn the boats is a great book. Although having a casual job isn’t a safety net, it’s just smart. After-all, you need cash injections. You certainly can leave your full time though.', 'upvotes': 4}, {'author': 'US_Dept_Of_Snark', 'created': '2025-01-03 20:46:22', 'text': 'Best of luck to you and well wishes! I wish I would have caught the vision much earlier in life. I have too many responsibilities to give up my corporate job right now or to dedicate to entrepreneurship. Time is on your side friend. Go make it happen!', 'upvotes': 4}, {'author': 'alvayeezy', 'created': '2025-01-03 21:58:22', 'text': 'Follow your dreams', 'upvotes': 4}, {'author': 'ichfahreumdenSIEG', 'created': '2025-01-03 22:46:37', 'text': 'You can only take an island if you have resources and an army. You can’t take an island by burning your canoe and fighting with sticks. Get your network up, get your money up, then go to war.', 'upvotes': 5}, {'author': 'ImpossibleBell4759', 'created': '2025-01-03 22:36:19', 'text': 'Go for i while you're young. I wish I had so many opportunities back in the day. The internet opens up a whole new world.', 'upvotes': 3}, {'author': 'DesignerAnnual5464', 'created': '2025-01-03 22:57:56', 'text': 'I think the biggest thing that helped me when I made a similar decision was realizing that if you don't go all in, you'll always wonder "what if?" it can be scary, but the freedom to focus on your own vision is priceless. Make sure to pace yourself and be kind to your mental health, especially as you push through the tough times. You've got this—wishing you tons of success! Keep me posted on how things go!', 'upvotes': 3}, {'author': 'SniperQueen_', 'created': '2025-01-03 22:59:15', 'text': 'I feel ya. I did the exact same thing. I was fed up with my job. Working 530a to 7p with a 4 hr break from 9am to 1p. I was missing my 2 year old twins, my life, everything. I was over worked and underpaid. No time at all. So I started learning how to trade in the market Sept 2019. By November 2019 I was making more in trading than I was on my job so I quit in Dec & now I have time & money together. True freedom. Now I’m on a mission to help others do the same. That’s all I do.', 'upvotes': 3}, {'author': 'savethecomments', 'created': '2025-01-04 00:13:09', 'text': 'Please read the books which gets listed on this sub…. Right away', 'upvotes': 3}, {'author': 'Background-Dare-9849', 'created': '2025-01-04 09:13:09', 'text': 'In 2022 i graduated from college and became a teacher I realized immediately that I hated it. Art is my true passion and even while I was teaching I was painting after work or on the weekends. In 2023 I had the chance to come back for the new school year I decided not to. Since then I have been painting selling some of my pieces and I have enrolled into art school. I felt it in my soul that teaching was not for me and now that I am on the other side of it I feel so good I could no longer run from who I truly was and it seems like you aren’t either. Wishing you all the best on your journey💕', 'upvotes': 3}, {'author': 'Delicious-Wolf-1876', 'created': '2025-01-03 21:35:37', 'text': 'Good luck', 'upvotes': 2}, {'author': 'DanHodderfied', 'created': '2025-01-03 21:48:20', 'text': 'What are you leaping to? Has your business started to make some profit?', 'upvotes': 2}, {'author': 'assertive_', 'created': '2025-01-03 22:03:06', 'text': 'I'm working on it too. But my approach is to validate my product first and find the my customers who wants to purchase my product, before I leave my job. I also have a general idea which markets need it.', 'upvotes': 2}, {'author': 'Particular_Two_5177', 'created': '2025-01-03 22:12:00', 'text': 'I just did this in September...well, I was forced to buy a layoff but decided to go for it. Best to do it when your young. I have a family of 5, house payment, and other things to worry about. Luckily I'm starting my business with clients already and plenty of work to keep me busy. Thankfully, my state also allows self employed to claim unemployment benefits while starting a business.', 'upvotes': 2}, {'author': 'BlackCatTelevision', 'created': '2025-01-03 22:18:43', 'text': 'Do you have runway?', 'upvotes': 2}, {'author': 'Melodic_Ad6299', 'created': '2025-01-03 22:19:08', 'text': 'Good luck', 'upvotes': 2}, {'author': 'AbusedShaman', 'created': '2025-01-03 22:48:54', 'text': 'Go for it man.', 'upvotes': 2}, {'author': 'TelephoneHead229', 'created': '2025-01-03 23:12:30', 'text': 'Yes, go for it. If you don't go after what you really want, you'll always be stuck where you don't want to be. Besides, with a 9-5 you're satisfying someone else's dreams, not yours. I quit my 9-5 in 2012, I joined the online space where I am my own boss and I enjoy helping others see other options than a 9-5. Online income is another way to survive.', 'upvotes': 2}, {'author': 'DysneyHM', 'created': '2025-01-04 01:10:22', 'text': 'I’m 27 and considering this but I’m terrified lol', 'upvotes': 2}, {'author': 'ScratchPad777', 'created': '2025-01-04 01:23:47', 'text': 'The Universe favors the courageous. Stay consistent. Go Big!!!!...no regrets', 'upvotes': 2}, {'author': 'forward_attitude316', 'created': '2025-01-04 01:54:52', 'text': 'Way to go!! I believe in betting on yourself. I am a ex corporate recruiter and the way job market is now days. I say go for it!', 'upvotes': 2}, {'author': 'christo9090', 'created': '2025-01-04 04:46:38', 'text': 'As someone who learned this too late. Go for it. Better than wishing you did 10 years later', 'upvotes': 2}, {'author': 'UsualElk2929', 'created': '2025-01-04 08:09:23', 'text': 'Congrats! Starting at this age is impressive.', 'upvotes': 2}, {'author': 'Impossible_Still2959', 'created': '2025-01-04 09:32:21', 'text': 'It's in your twenties that man is allowed to make many mistakes so that by his 30s he know where to settle,go for it.', 'upvotes': 2}, {'author': 'No_Cold278', 'created': '2025-01-04 10:38:56', 'text': 'You're doing the right thing. Kudos to you for taking the major step. I'm 25F, and in the same boat as you are. I am in a major dilemma about quitting my job to work 2 jobs with companies who are my competitors. My current job is cozy and really nice. I don't want to leave it (leave my comfort zone) but I have to take the leap and go with the other 2 companies that are better and in my field/ my vision.', 'upvotes': 2}, {'author': 'stackmatix', 'created': '2025-01-04 11:59:01', 'text': 'That's an exciting leap! Taking the risk now, especially with no major responsibilities, is a smart move. Stay focused, keep learning, and don’t be afraid of challenges. Best of luck with your SaaS journey!', 'upvotes': 2}, {'author': 'NoAntelope1712', 'created': '2025-01-03 20:43:18', 'text': 'I can completely relate to what you're going through, and I have a few thoughts I’d love to share based on my own experience. First off, I think it's awesome that you're going all in with your SaaS agency. That leap of faith you’re taking? It’s a big one, but I can tell you, it’s one that could change everything for you if you stay focused and keep pushing forward. I’ve been in a similar spot before, wanting to break out of the 9-5 grind and do something meaningful. It’s tough—mentally draining, like you said—but here’s what I’ve learned: You have to keep reminding yourself why you’re doing it. It’s easy to get caught up in the day-to-day hustle and lose sight of the bigger picture. It sounds like you have a clear vision, so stick to that when things get tough. I’m also a firm believer in having a plan, even when you burn the boats. That’s not to say you need a 10-step plan for everything, but know where you want to go and the actions you need to take to get there. Staying flexible is key because things won’t always go as planned, but if you’re adaptable, you'll keep moving forward. And one last thing: Trust the process, but also trust yourself. There will be moments of doubt, of course. That’s normal. But remember, you’re betting on yourself, and that’s powerful. If you stay consistent, learn from each setback, and keep improving, you'll see the progress you want. Good luck with the leap! You’ve got a strong foundation, and I’m confident you’ll make it work. Don’t hesitate to reach out if you need someone to bounce ideas off of or share struggles along the way—I've been there and would be happy to support you in any way I can.', 'upvotes': 3}, {'author': 'YakSevere3652', 'created': '2025-01-03 23:43:57', 'text': 'This is my goal. But just don’t how to start.', 'upvotes': 1}, {'author': 'maximilian-on-reddit', 'created': '2025-01-04 06:33:11', 'text': 'Congrats on this big decision! Hope it works out :) Did you try working on your projects on the side to see if there's interest before leaving?', 'upvotes': 1}, {'author': 'Sonar114', 'created': '2025-01-04 09:07:41', 'text': 'Don’t do it. You’ll only shorten your runway and give yourself a worse chances of success. Your success of failure doesn’t depend on your personal level of commitment, that’s just something narcissists and people sell courses say. It will come down to your strategy, ability to execute and your available resources. If the only way you can motivate yourself to work is by burning bridges and massively constraining your financial position, you’re probably not ready.', 'upvotes': 1}, {'author': 'mrtrly', 'created': '2025-01-04 11:07:56', 'text': 'I love seeing these stories! Congrats on the big move! I did the same about 20 years ago. I wouldn’t go back but it’s definitely been extremely challenging at times, and amazing at others. 2 things I wish I did better. Save for slow times, because they will happen. And keep your personal expenses very low. This will make sure you can take the big risks when opportunities arise. The goal now is to keep the business running so keep your runway long and keep a long term perspective. Good luck! Exciting times ahead!', 'upvotes': 1}, {'author': 'timberworxinit', 'created': '2025-01-04 11:36:28', 'text': 'Here is what I truly think. You will never rise to the level of your goals, you will always fall to the level of your skills. You can burn the boat, but don’t. Your reputation will follow you. If you don’t have skills in management and finance, you will be lost when it comes to business management. You need skills in building credit, setting up vendor accounts, and much more. Lean on Your network of people because you can’t do it alone, no one can. If you want this entrepreneur journey, (be careful what you wish for) then do it, but know you can always go back to a w2 to stabilize your life again. Good luck!', 'upvotes': 1}, {'author': 'FamousImage1027', 'created': '2025-01-04 11:45:07', 'text': 'I opened a company that focuses on imports and online sales. It is not drop shipping because I am an intermediary who obtained the prices directly from the manufacturer. In the online environment, I do not manage to build a network of clients. I don't have capital to invest in advertising and I can't find a free platform to promote my ads. In 2 months I obtained an absurd number of 1 views for all 7 ads. What do you suggest I do? difficult', 'upvotes': 1}, {'author': 'Quick-Mortgage-1495', 'created': '2025-01-04 12:48:34', 'text': 'All the best my guy... but I hope you are comfortable with riding the struggle rollercoaster and living broke-like for foreseeable future.. Have you considered any part-time gigs to keep the lights on? And do you have a plan for how you are gonna spend your time now? To make the most of all the time you have freed up from the 9 to 5 grind? Rooting for you young G', 'upvotes': 1}, {'author': 'Intelligent-Snow-744', 'created': '2025-01-04 13:28:03', 'text': 'Amazing .... i started my first company last year with my mom to made partner im very proud about that', 'upvotes': 1}, {'author': 'uepodcast2021', 'created': '2025-01-04 14:09:59', 'text': 'Congratulations for getting across the start line in your entrepreneur adventure. Getting started is probably one of the hardest things to do. I was just curious what got you started in SaaS products? What kind of struggles do you face getting things started', 'upvotes': 1}, {'author': 'Hippie_guy314', 'created': '2025-01-04 17:50:15', 'text': 'Go all in - just don't use debt - twas my biggest mistake. Hit hard with your time and your money. Best of luck!', 'upvotes': 1}, {'author': '126270', 'created': '2025-01-03 20:39:49', 'text': 'TL;DR: op landed 1 client in ~3 months and now is quitting to be their own ceo!! Op spammed reddit about a dozen times over the last 2-3 months, about 1/2 the posts op is complaining that he can’t find any clients, the other 1/2 just low effort please sign up for my mvp… Well look at those big stones on Brad! Good luck in ‘25 big stones!', 'upvotes': 1}, {'author': 'Reikoii', 'created': '2025-01-03 20:45:00', 'text': 'thanks man!! yep failure isn't something I fear as much as I fear not trying, so as long as I try I'll be happy haha', 'upvotes': 12}, {'author': 'Reikoii', 'created': '2025-01-03 21:16:15', 'text': 'Honestly i love the freedom it gives me, i can work wherever whenever. All i need is my laptop.', 'upvotes': 10}, {'author': 'Reikoii', 'created': '2025-01-03 21:17:47', 'text': 'Same! I’d rather fail than not try', 'upvotes': 6}, {'author': 'Reikoii', 'created': '2025-01-03 20:43:41', 'text': 'thanks man! I'm currently building a platform where you can find a co-founder for your idea based on the skillset you want, I've seen lots of people here or In X looking for technical or marketing co-founders so I thought that would make the search easier', 'upvotes': 6}, {'author': 'Reikoii', 'created': '2025-01-04 03:14:07', 'text': 'Thanks man, I’ll make the best out of it', 'upvotes': 1}, {'author': 'Reikoii', 'created': '2025-01-04 03:16:25', 'text': 'The SaaS didn’t but the agency is making a little bit of money, i think that’s a good enough backup', 'upvotes': 2}, {'author': 'BlackCatTelevision', 'created': '2025-01-03 22:17:58', 'text': 'Save up runway before you leave!! Including your own living expenses!', 'upvotes': 3}, {'author': 'Reikoii', 'created': '2025-01-04 03:18:20', 'text': 'A little one haha', 'upvotes': 1}, {'author': 'Reikoii', 'created': '2025-01-04 03:22:40', 'text': 'I’m more terrified of staying like that my whole life haha so that’s an easy decision', 'upvotes': 3}, {'author': 'Reikoii', 'created': '2025-01-03 20:47:56', 'text': 'thanks for the support man!! I'll be doing my best', 'upvotes': 2}, {'author': 'Arthurobo', 'created': '2025-01-03 20:45:36', 'text': 'Yeah, I’ve seen a couple of people trying to find the right person for a co-founder too. Wishing you the best there in your space.', 'upvotes': 2}, {'author': 'JoeBxr', 'created': '2025-01-03 22:09:18', 'text': 'A competitor to coffeespace... Sounds good', 'upvotes': 1}, {'author': 'NoAntelope1712', 'created': '2025-01-03 20:57:08', 'text': 'You're welcome! Stay focused and trust yourself. You've got this. Let me know how things are going -happy to chat anytime!', 'upvotes': 2}], 'id': '1ht0cci', 'num_comments': 58, 'text': 'I’ve made up my mind—this week, **I’m quitting my 9-5 job.** I’m 22 years old, single, with no major responsibilities holding me back. If there’s ever a time to take a leap of faith and bet on myself, it’s now. For the past few months, I’ve been building a SaaS agency and working on other SaaS tools in my free time, and I’m ready to go all in. There’s a proverb I can’t stop thinking about: ***“If you want to take the island, burn the boats.”*** That’s exactly what I’m doing. No fallback, no safety net—just full focus and drive to make this work. The truth is, the 9-5 grind has been wearing me down mentally. It feels like every day, I’m pouring my energy into something that isn’t aligned with what I really want to achieve. I have big aspirations, and staying in this routine is holding me back. I know it’s a risk, but it’s one I’m willing to take. If I don’t try now, **I’ll always wonder what could’ve been.** Wish me luck—and if you’ve taken a similar leap, I’d love to hear your story. What pushed you to take the risk, and how did it go?', 'title': 'Yes, I’m Doing It—Quitting My Job This Week', 'upvotes': 121, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1ht0cci/yes_im_doing_itquitting_my_job_this_week/'}, {'comments': [{'author': 'StaticCharacter', 'created': '2025-01-04 06:09:11', 'text': 'I think sales will always be the highest earning skill. No matter what your career is, you're going to have to sell yourself, your ideas, and your competence to others. Being good isn't worth anything if no one believes it.', 'upvotes': 79}, {'author': 'onlywc11', 'created': '2025-01-04 06:44:46', 'text': 'Sales. I hate my job but it pays wel so yeah..', 'upvotes': 25}, {'author': 'Potential_Archer2427', 'created': '2025-01-04 08:11:34', 'text': 'Coding and sales', 'upvotes': 12}, {'author': 'Louisianimal_420', 'created': '2025-01-04 04:15:39', 'text': 'OF', 'upvotes': 53}, {'author': 'Marjers', 'created': '2025-01-04 09:10:07', 'text': 'Took advantage of the crypto boom this year and built a platform where players play against each other trying to predict the price of commodities and crypto for the next seconds. Live of the fees to maintain the platform', 'upvotes': 11}, {'author': 'Early_Translator5887', 'created': '2025-01-04 10:09:17', 'text': 'Cutting the fat. Getting rid of human interactions. Having a strong defense against fraud. Using deposits to keep customers from stealing or damaging your rental gear. Hardening your business against scammers. Continuously improving your reputation with repeat customers by fulfilling your duty to provide goods and services as advertised.', 'upvotes': 6}, {'author': 'sf_d', 'created': '2025-01-04 14:19:45', 'text': 'AI application architect can easily mean >$400k (US). The top 4 skills you will need are , coding , cloud computing knowledge, data science and machine learning.', 'upvotes': 5}, {'author': 'Different_Tap_7788', 'created': '2025-01-04 10:50:13', 'text': 'Carpenter', 'upvotes': 3}, {'author': 'NextGenNerd01', 'created': '2025-01-04 11:52:49', 'text': 'Traditional tech jobs are making bank, but let me tell you - the real gold mine right now is anything touching AI. Learn the basics properly, get good at actual coding, and then ride this AI wave. The money's insane, and we're just getting started.', 'upvotes': 4}, {'author': 'jamboman_', 'created': '2025-01-04 10:13:52', 'text': 'Work hard from 2005-2024', 'upvotes': 2}, {'author': 'Superb_Advisor7885', 'created': '2025-01-04 12:58:09', 'text': 'Taking risks, but reducing those risks with competency and preparation. Do this by taking a portion of your income and constantly reinvesting it. I actually don't earn that well compared to a lot of high income people, but I truly don't have to work very much either. I was making about $100k as a self employed sales person. Hired a few employees to continue to grow. Eventually grew to about $120k. Then started buying real estate. Have 20 tenants and earn $6k a month from that. Started living off the real estate and then hired several more people for my sales agency, including a sales manager and office manager. Now I'm making about $80k total, but I truly work 10 hours a week and my income should double in a year at which point I'll likely not more real estate.', 'upvotes': 2}, {'author': 'gregort17', 'created': '2025-01-04 10:20:33', 'text': 'Have extensive experience in closing sales. Most of the largest companies have a shortage of good closers and therefore companies will offer high commissions.', 'upvotes': 1}, {'author': 'HorseDongJon', 'created': '2025-01-04 16:48:08', 'text': 'Kegels', 'upvotes': 1}, {'author': 'hobbirik', 'created': '2025-01-04 12:49:59', 'text': 'prompt engineering', 'upvotes': -2}, {'author': 'TypicalBullfrog1575', 'created': '2025-01-04 08:39:59', 'text': 'Be seeing this all over since 24 till 25. I think God and the gods want me to join and testify', 'upvotes': 5}, {'author': 'CobblerEducational62', 'created': '2025-01-04 17:26:07', 'text': 'What would you say is the best way to learn sales? Currently reading “never split the difference” and it’s very eye opening though I haven’t been able to put it into practice', 'upvotes': 2}, {'author': 'FrontMeat8318', 'created': '2025-01-04 06:44:13', 'text': 'Even in management this is a perk!', 'upvotes': 2}, {'author': 'Big_Draw_5978', 'created': '2025-01-04 07:13:41', 'text': 'Amen.', 'upvotes': 2}, {'author': 'Emma_Pauline', 'created': '2025-01-04 13:37:37', 'text': 'I hate mine too. Recovery officer.', 'upvotes': 1}, {'author': 'SrDeathI', 'created': '2025-01-04 10:43:40', 'text': 'I'm a developer and yeah if you can't sell it doesn't really matter if you are god at coding', 'upvotes': 4}, {'author': 'TypicalBullfrog1575', 'created': '2025-01-04 08:40:45', 'text': 'What do you sell apart from the self sales?', 'upvotes': 1}, {'author': 'Klutzy_Knowledge3784', 'created': '2025-01-04 04:18:32', 'text': '😂😂😂', 'upvotes': 2}, {'author': 'mbttonajenati', 'created': '2025-01-04 13:58:20', 'text': 'OFM?', 'upvotes': 1}, {'author': 'mrchef4', 'created': '2025-01-04 08:28:41', 'text': 'Lol. You could maybe look into getting leads for businesses in Upwork? people tend to pay good money for that and there’s a big demand for it. also career growth in marketing can be both challenging and rewarding. a few tips that have helped me: specialise in a niche area like content strategy or analytics to stand out, stay updated on trends (I watch a lot of YouTube videos to learn and read [https://trends.co](https://trends.co) ($300/year) and [https://theadvault.co.uk](https://theadvault.co.uk) (free) religiously), and get comfortable with analytics, knowing how to measure and interpret results is key. also, networking with other marketers has been invaluable for learning and staying connected in the industry. hope this helps, you can do it', 'upvotes': -12}, {'author': 'BillySavery', 'created': '2025-01-04 10:02:10', 'text': 'Nice idea!', 'upvotes': 1}, {'author': 'Youknowwhat-i-mean', 'created': '2025-01-04 15:10:40', 'text': 'This. Are you one?', 'upvotes': 0}, {'author': 'klawz22', 'created': '2025-01-04 17:10:51', 'text': 'The basics, can you direct me as to what they are?', 'upvotes': 1}, {'author': 'StaticCharacter', 'created': '2025-01-04 17:45:29', 'text': '*in short:* Find someone you can learn from. Direct sales is the most effective imo. In my young days I did a bunch to learn sales. Reading Dale Carnegie and Zig Ziglar, working a handful of door to door and other direct sales jobs. The most impactful thing for me was finding a successful person that I respected to teach me. It happened accidentally, this woman I met was doing door to door at the same time I was for a different company, and I struck a conversation. I was feeling pessimistic and jaded, and she was full of optimism and whimsy. I literally quit my job and asked her if I could join her team. Shadowing her opened my eyes to how sales could be. She was so full of hope that people were good, and that when they were mean to us, they were just having bad days. She believed in what she sold, and would always try to do her best to help the client. She would build real meaningful connections with everyone she crossed in seconds. She could talk to you for a minute and end up being at your wedding telling stories of all the things that made you successful. I never became as good as she did, but being a shy money hungry person full of pain, this experience fundamentally changed the way I looked at life and "goal oriented communication". Everyone needs a Lindsey in their life haha but I don't know how you could find yours.', 'upvotes': 1}, {'author': 'Potential_Archer2427', 'created': '2025-01-04 09:48:50', 'text': 'Idk, it's not even just about selling products though, sales skills are very transferrable to many aspects in life', 'upvotes': 2}, {'author': 'TypicalBullfrog1575', 'created': '2025-01-04 08:38:15', 'text': 'Its not funny like that', 'upvotes': -2}, {'author': 'HalalTikkaBiryani', 'created': '2025-01-04 09:53:19', 'text': 'Are you a bot by any chance', 'upvotes': 5}, {'author': 'NextGenNerd01', 'created': '2025-01-04 17:52:51', 'text': 'Start with getting comfortable in a programming language - Python is honestly your best choice right now, especially given its dominance in the AI ecosystem. Focus on understanding core programming concepts - loops, functions, OOP - not just syntax memorization. Data structures and algorithms are absolutely essential. Yeah yeah, I know everyone hates grinding LeetCode, but understanding how to work with arrays, hash maps, trees, and basic algorithms will level up your problem-solving skills significantly. Master version control (Git), get comfortable with APIs, and learn database fundamentals. Add some basic system design knowledge, and you have got a solid foundation to build on. Don't rush through these concepts. Take the time to really understand them properly.', 'upvotes': 1}, {'author': 'OSHA-Slingshot', 'created': '2025-01-04 17:54:40', 'text': 'This is what people don't get with the word "sales". It's about helping and becoming friends with people instantly. If they don't like you, they wont trust you, if the don't trust you they wont think you want to help them, if they don't think you're there to help they won't buy. None of this can be faked, which is what makes it so hard. > but being a shy money hungry person full of pain This is where most people are, and don't know it.', 'upvotes': 1}, {'author': 'Klutzy_Knowledge3784', 'created': '2025-01-04 14:14:05', 'text': 'Only fans as a side hustle ? Sure yea definitely not funny.. I’m not judging it but let’s be real man,dude wasn’t asking about only fans😂', 'upvotes': 2}, {'author': 'ThrowbackGaming', 'created': '2025-01-04 16:28:25', 'text': 'Yes, he spams the same 2 links in every post. Not sure why he isn't banned yet. Look at his post history.', 'upvotes': 1}, {'author': 'mrchef4', 'created': '2025-01-04 10:53:56', 'text': 'Lol yeah I’m the upgraded MrChef 4.0 bot', 'upvotes': 0}, {'author': 'TypicalBullfrog1575', 'created': '2025-01-04 15:20:49', 'text': 'You can't be joking, he may be serious you know', 'upvotes': -2}, {'author': 'ripndipp', 'created': '2025-01-04 13:31:51', 'text': 'Subscribe', 'upvotes': 1}], 'id': '1ht8xl4', 'num_comments': 43, 'text': '.', 'title': 'People who earn well, what are some of the high earning skills of 2025?', 'upvotes': 27, 'url': 'https://www.reddit.com/r/Entrepreneur/comments/1ht8xl4/people_who_earn_well_what_are_some_of_the_high/'}]